# -*- coding: utf-8 -*-

# Золушка - http://sheba.spb.ru/libra/perro_zolushka.htm

cinderella = [
    [[1, 1, 1, 1, 1],  # 1
     [
         'Жил-был вдовец, у которого была прелестная добрая дочка. Однажды он решил жениться вновь и взял в жёны злую, эгоистичную женщину. У неё были две дочери, которые по характеру были как две капли воды похожи на свою мать. ',
         'После свадьбы мачеха сразу же показала свой злой нрав. Она прекрасно понимала, что рядом с красивой добросердечной падчерицей её родные дочки выглядят ещё грязнее и уродливее. ',
         'Поэтому она возненавидела падчерицу и заставляла её делать всю самую грязную работу по дому. ',
         'Бедная девочка готовила и стирала, убирала комнаты сестёр и мыла лестницы. Сама же она жила в маленькой тесной каморке на чердаке. Она переживала за своего тихого отца, которого страшно третировала новая жена. ',
         'По вечерам она часто сидела на тёплой золе у самого очага, поэтому её прозвали Золушкой. Но, несмотря на своё имя, она была в своих лохмотьях в сто раз милее, чем её сёстры в дорогих платьях, расшитых золотом.'
     ]],  # 2
    [[1, 1, 1, 1, 1],
     [
         'Однажды королевский сын давал бал в свою честь и разослал приглашения всем подданным своего королевства. Сёстры Золушки были в восторге от этого и целыми днями примеряли вороха новых платьев, специально накупленных по этому случаю. ',
         '- Я надену красное бархатное платье, - говорила старшая, - с отделкой из ручных кружев. ',
         '- А я надену вот это гладкое бальное платье, - говорила вторая сестра, - но поверх него я надену свои бриллианты и шляпу с золотыми цветами. ',
         'Они советовались с самым лучшим парикмахером насчёт модных причёсок. У Золушки был отличный вкус, поэтому у неё тоже спрашивали совета. ',
         '- Я сделаю вам самые модные причёски во всём королевстве, - сказала Золушка.'
     ]],  # 3
    [[1, 1, 1, 1, 1],
     [
         'Сёстры милостиво согласились. Пока она причёсывала их, они выпытывали у неё: ',
         '- Тебе бы хотелось пойти на бал, Золушка? ',
         '- Я боюсь, что меня не пустят на бал, - отвечала Золушка. ',
         '- Ты права. Только представишь тебя на балу и сразу можно умереть со смеху! ',
         'Любая другая девочка отомстила бы за такие насмешки и сделала бы их причёски похожими на копны сена. Но она как можно лучше причесала сестёр. Они были довольны.'
     ]],  # 4
    [[1, 1, 1, 1, 1],
     [
         'Они постоянно крутились и вертелись перед зеркалами и даже совсем забыли про еду. Чтобы сделать свои талии потоньше, они истратили кучу лент, замотавшись в них, как в коконы. ',
         'Наконец они были готовы ехать на бал. Золушка проводила их до порога и немножко всплакнула от одиночества. ',
         'Золушкина крёстная мать, волшебница, пришла посмотреть, почему она плачет. - Как я мечтаю попасть на бал! - всхлипывала Золушка. - Делай всё, как я скажу, а там посмотрим, - сказала волшебница. - Принеси мне из сада большую тыкву. ',
         'Золушка побежала в сад и принесла самую большую тыкву, какую только могла принести. Волшебница выдолбила тыкву, а затем коснулась её волшебной палочкой. Она мгновенно превратилась в прелестную золотую карету. ',
         'Потом она заметила в мышеловке шесть маленьких мышей. Она выпустила их и, прикоснувшись к ним волшебной палочкой, превратила их в шесть красивых быстроногих коней.'
     ]],  # 5
    [[1, 1, 1, 1, 1],
     [
         'Теперь не хватало кучера. - Крыса подойдёт? - спросила Золушка. - Конечно, - ответила крёстная. ',
         'Золушка принесла крысоловку. Волшебница выбрала крысу с самыми длинными усами и превратила её в толстого важного кучера. ',
         'Затем она сказала: - У ворот сада сидят шесть ящериц. Принеси их мне. ',
         'Золушка быстро исполнила приказание. Волшебница превратила их в ловких слуг, стоящих на запятках кареты. ',
         '- Ну а теперь, ты можешь ехать на бал, - сказала она. - Ты довольна? - Конечно, - ответила сияющая от счастья Золушка. - Но удобно ли мне будет появиться там в этих лохмотьях?'
     ]],  # 6
    [[1, 1, 1, 1, 1],
     [
         'Волшебница взмахнула своей палочкой и золушкины лохмотья превратились в роскошный, затканный золотом и серебром наряд. ',
         'Её стоптанные башмаки превратились в хрустальные туфельки, словно предназначенные именно для бальных танцев. Золушка была ослепительно красива в своём наряде. ',
         'Золушка уселась в карету, и волшебница сказала ей: - Желаю тебе весело провести время. Но запомни одну вещь. Ты должна покинуть бал ровно в полночь. Если ты не сделаешь этого, твоя карета превратится в тыкву, лошади опять станут мышами, слуги - ящерицами, а твоё роскошное бальное платье - грязными лохмотьями. ',
         'Золушка пообещала крёстной покинуть бал ровно в полночь и умчалась. ',
         'Слуги доложили принцу, что на бал приехала прекрасная богатая незнакомка. Он поспешил встретить её и проводить во дворец. Лёгкий шёпот изумления и восторга пробежал по залу.'
     ]],  # 7
    [[1, 1, 1, 1, 1],
     [
         'Все взгляды были прикованы к красавице. Старый король шепнул королеве, что он уже много лет не видел такого чуда. ',
         'Дамы внимательно рассматривали её наряд, стараясь не упустить ни одной мелочи, чтобы завтра же заказать себе такой же, если им только это удастся. ',
         'Принц пригласил её на танец. Одно удовольствие было смотреть, как она танцует. Подали ужин, но принц совсем забыл про еду, его глаза не отрывались от глаз прекрасной незнакомки. ',
         'Она села рядом со своими сводными сёстрами и угостила их экзотическими фруктами из корзинки, которую преподнёс ей принц. Они зарделись от удовольствия, удостоившись такой чести, но не узнали Золушку. ',
         'В самый разгар бала часы пробили три четверти двенадцатого. Золушка попрощалась со всеми и поспешила уйти. Вернувшись домой, она сердечно поблагодарила волшебницу и попросила у неё разрешения назавтра опять отправиться на бал, поскольку принц очень просил её приехать. Волшебница обещала ей помочь опять.'
     ]],  # 8
    [[1, 1, 1, 1, 1],
     [
         'Вскоре явились сёстры с мачехой. Золушка, притворившись, что она спала, зевая, открыла дверь. ',
         'Сёстры были в страшном возбуждении от появления на балу красавицы-незнакомки. - Она была красивей всех на свете, - без умолку тараторила старшая сестра. - Она даже угостила нас фруктами. ',
         'Золушка улыбнулась и спросила: - А как её звали? - Никто не знает. Принц отдал бы что угодно, лишь бы узнать, кто она такая? ',
         '- Как я хочу увидеть её. Не смогли бы вы одолжить мне какое-нибудь ненужное вам платье, чтобы я тоже смогла пойти на бал? - спросила Золушка. ',
         '- Что? Ты собираешься напялить на себя наши платья? Никогда! - зашикали на неё сёстры.'
     ]],  # 9
    [[1, 1, 1, 1, 1],
     [
         'Золушка была уверена, что так и случится. Если бы они разрешили ей, что бы она делала? На следующий вечер сёстры опять отправились на бал. ',
         'Золушка тоже поехала вскоре после них, одетая ещё более богато, чем в прошлый раз. Принц не покидал её ни на минуту.  Он был так любезен и мил, что Золушка совсем забыла про наказ волшебницы. ',
         'Вдруг она услышала, как часы пробили полночь. Выскочив из зала, она помчалась к выходу, как быстроногая лань. ',
         'Принц попытался поймать её. Вдруг с её ноги соскользнула и упала хрустальная туфелька, и принц еле успел подхватить её. ',
         'Едва достигнув ворот дворца, Золушка превратилась в грязную замарашку в лохмотьях, а карета, кучер и слуги в тыкву, крысу и ящериц. Ничего больше не напоминало о волшебстве, кроме хрустальной туфельки, оставшейся у неё.'
     ]],  # 10
    [[1, 1, 1, 1, 1],
     [
         'Она прибежала домой чуть раньше сестёр. Они опять рассказали ей о том, что прекрасная незнакомка появлялась вновь. Она была ещё лучше, чем прежде. ',
         'Но она исчезла так внезапно, что потеряла хрустальную туфельку. Принц нашёл её и спрятал у сердца. Все уверены, что он безумно влюблён в незнакомку. ',
         'Они были правы. На следующий день принц объявил, что женится на той девушке, которой хрустальная туфелька окажется впору. Принцессы, герцогини и придворные дамы - все примеряли туфельку, но безуспешно. ',
         'Придворные принесли туфельку и к золушкиным сёстрам. Они изо всех сил старались надеть туфельку, но безуспешно. Тогда Золушка спросила: - Можно мне попробовать тоже? ',
         'Её сёстры рассмеялись. Но королевский слуга сказал: - Мне дан приказ примерять туфельку всем девушкам королевства без исключения.'
     ]],  # 11
    [[1, 1, 1, 1, 1],
     [
         'Туфелька свободно наделась на золушкину ножку, как будто была сделана по ней. Тут же Золушка достала из кармана вторую туфельку, и все вокруг застыли в изумлении. ',
         'Появившаяся тут же волшебница, коснулась Золушки волшебной палочкой, и она превратилась в богато одетую красавицу-незнакомку. ',
         'Вот тут-то сёстры и узнали её. Они упали перед ней на колени и покаялись во всех своих дурных делах. Золушка простила их и предложила им стать друзьями. ',
         'С почётным эскортом Золушку проводили во дворец, где с нетерпением ожидал её молодой красавец-принц. Через несколько дней они поженились и справили пышную свадьбу. ',
         'Золушка была так же добра, как и красива. Она взяла сестёр жить во дворец и вскоре выдала их замуж за знатных вельмож.'
     ]]]
