# -*- coding: utf-8 -*-

# Попелюшка - http://kazkar.at.ua/publ/avtorska_kazka/sharl_perro/popeljushka_abo_krishtalevij_cherevichok_kazka_z_kartinkami/12-1-0-113

cinderella = [
    [[1, 1, 1, 1, 1],  # 1
     [
         'Один багатий удівець одружився вдруге з удовою, такою чванливою та гордовитою, якої, відколи світ світом, ніхто й не бачив. Вона мала двох дочок, теж чванливих і гордовитих. А в чоловіка була своя дочка, надзвичайно добра та ніжна - вся в матір, найкращу жінку в світі. ',
         'Не встигли відсвяткувати весілля, як мачуха вже показала свою лиху вдачу. Вона ненавиділа пасербицю за її красу, бо поряд з нею її власні дочки здавалися ще огиднішими. ',
         'Отож мачуха й загадувала дівчині робити найбруднішу роботу в домі - мити посуд, прати одежу, прибирати кімнати. ',
         'Спала дівчина аж під самим дахом, на горищі, на благенькому солом’яникові, тим часом як сестри її жили в розкішних покоях з м’якими постелями та дзеркалами, що в них бачили себе з голови до ніг. ',
         'Упоравшись з роботою, дівчина йшла в куток і сідала просто на попіл, натрушений біля каміна. Тому всі в домі звали її Чорногузкою. А менша сестра, не така лиха, як старша, прозвала її Попелюшкою. Та навіть в лахмітті і в попелі Попелюшка була куди гарніша за своїх сестер, хоч ті й ходили в пишних шатах.'
     ]],  # 2
    [[1, 1, 1, 1, 1],
     [
         'Якось син короля, молодий і гожий принц, улаштував бал і запросив на нього всіх знатних людей королівства. Наші дві панночки теж дістали запрошення, бо їх мали за поважних осіб у тій країні. Почалися клопоти й турботи - треба ж було приготувати сукні й оздоби і вибрати зачіски, які їм були б найбільше до лиця. ',
         '- Я, - сказала старша, вберуся в сукню з червоного оксамиту й почеплю оздоби, які мені привезли з Англії. ',
         '- А я, - мовила менша, - вберуся в буденну сукню, та зате надіну накидку, гаптовану золотими квітами, й діамантове намисто - такого ні в кого немає! ',
         'Вони замовили наймодніші капелюшки, накупили найдорожчих парфумів і пудри. Вдягнувшись, покликали Попелюшку подивитися - адже вони знали, що в неї хороший смак.',
         'Дівчина дала сестрам мудрі поради і навіть запропонувала зачесати їх. Ті залюбки погодились.'
     ]],  # 3
    [[1, 1, 1, 1],
     [
         'Коли вона їх зачісувала, сестри спитали: ',
         '- А ти, Попелюшко, хочеш поїхати на бал? ',
         '- Ой сестриці, не смійтеся з мене! Чи ж мені личить там бути? ',
         '- А й справді, всі сміялися б, якби побачили на балі Чорногузку! ',
     ]],  # 4
    [[1, 1, 1, 1, 1],
     [
         'Якась інша дівчина за такі слова, певно, зіпсувала б злим сестрам зачіски. Але Попелюшка була добра та незлостива і зачесала їх так гарно, що кращого годі було й бажати.'
         'Сестри два дні майже нічого не їли, крутилися перед дзеркалами і весь час роздивлялися - чи не схудли, бува, і чи не треба ще тугіше зашнурувати їх, - адже вони хотіли бути тонесенькими та стрункими. Аж ось щаслива мить настала. Сестри з матір’ю сіли в карету й поїхали на бал. Попелюшка довго стояла під брамою й сумно дивилася їм услід. Коли ж карета зникла з очей, дівчина сіла на ґанку й гірко заплакала.',
         'Раптом з’явилася її хрещена мати - чарівниця. Побачивши, що дівчина вмивається сльозами, вона спитала: - Що сталося? - Я хотіла б... хотіла б... - сказала Попелюшка й заплакала так гірко, що не могла більше вимовити й слова. - Ти хотіла б поїхати на бал, авжеж? - спитала чарівниця. ',
         '- Авжеж! - відповіла Попелюшка, схлипуючи. - Дуже, дуже хотіла б. - Не плач, усе буде добре, - мовила чарівниця. - Якщо ти будеш слухняною дівчинкою, я зроблю так, що ти поїдеш туди. Вона вийшла з Попелюшкою на подвір’я і наказала: - Піди на город і принеси мені найкращий гарбуз! Попелюшка побігла на город, знайшла найкращий гарбуз, зірвала його і принесла хрещеній матері, й гадки не маючи, як цей гарбуз допоможе їй поїхати на бал. ',
         'Чарівниця розрізала гарбуз, вибрала насіння, вдарила по ньому своєю чарівною паличкою - і в ту ж мить гарбуз перетворився на розкішну визолочену карету. Потім вона заглянула в мишачу пастку й побачила в ній шестеро мишей. Вона звеліла Попелюшці відчинити пастку. Миші одна по одній вибігали з неї, чарівниця доторкалася до кожної своєю чарівною паличкою, і кожна миша оберталася на чудового коня. Отак з’явилося шестеро гарних коней, мишасто-сірих у яблуках.'
     ]],  # 5
    [[1, 1, 1, 1, 1],
     [
         'Тепер черга була за кучером. - Піду гляну на щурячу пастку, - сказала Попелюшка, - може, туди впіймався щур? От і був би нам кучер. - Чудово, - мовила хрещена мати, - піди глянь. ',
         'Попелюшка принесла щурячу пастку - там сиділо три великі щури. Чарівниця вибрала найбільшого, старого, з довгими сивими вусами й доторкнулась до нього своєю чарівною паличкою. Мить - і товстелезний кучер-вусань уже стояв перед ними. ',
         'Потім хрещена мати сказала Попелюшці: - Піди-но в садок: - там біля криниці ти знайдеш шість ящірок. Принеси їх мені. ',
         'Попелюшка принесла ящірок, і чарівниця обернула їх на шістьох лакеїв у строкатих лівреях; вони стрибнули на приступку позад карети, та так спритно, ніби за своє життя нічого іншого й не робили. ',
         'Тоді чарівниця сказала: - Ну ось, Попелюшко, тепер ти маєш у чому їхати на бал. Ти рада? - Авжеж! Тільки як же я поїду туди в цьому лахмітті? - зітхнула дівчина.'
     ]],  # 6
    [[1, 1, 1, 1, 1],
     [
         'Чарівниця доторкнулася до Попелюшки своєю паличкою, і враз її дранка перетворилася на розкішну сукню, гаптовану золотом, сріблом і самоцвітами. ',
         'Ще дала чарівниця дівчині пару кришталевих черевичків, таких гарненьких та ловких, що кращих не було ні в кого у світі. ',
         'Рада та весела, сіла Попелюшка в карету. На прощання хрещена мати наказала їй над усе пам’ятати, що вона може бути на балі тільки до півночі, бо опівночі всі чари зникають: карета знову стане гарбузом, коні - мишами, лакеї - ящірками, кучер - щуром, а її розкішна сукня - благенькою дранкою. ',
         'Попелюшка пообіцяла, що так і зробить. Вона поїхала до королівського палацу, не тямлячи себе від щастя. ',
         'Принц, якому доповіли, що приїхала якась незнайома принцеса, вийшов її зустріти. Він подав їй руку і повів до зали, де зібралися гості.'
     ]],  # 7
    [[1, 1, 1, 1, 1],
     [
         'В залі запала тиша. Гості перестали танцювати, музики грати: так уразила їх краса незнайомої дівчини. Чути було тільки шепіт: - О, яка вона гарна! ',
         'Король, хоч який був старий, теж не зводив з неї очей і пошепки сказав королеві, що давно вже не бачив такої вродливої й милої дівчини. Всі дами придивлялися до сукні та зачіски незнайомки, щоб завтра й собі зробити такі самі, якщо тільки знайдеться такий крам і такі вмілі кравці та перукарі... ',
         'Принц посадовив Попелюшку на почесне місце, а потім запросив до танцю. Вона танцювала напрочуд граційно, і всі гості милувалися нею. Після танців подали різні смачні наїдки та питва, але принц і не доторкнувся до них - він дивився тільки на красуню-гостю і думав тільки про неї. ',
         'А Попелюшка сіла біля своїх сестер, привітно розмовляла з ними й почастувала їх апельсинами та лимонами, якими пригостив її принц. Вони дуже здивувалися з такої люб’язності, бо не впізнали Попелюшку і мали її за невідому принцесу. ',
         'Раптом Попелюшка почула, що годинник вибив без чверті дванадцяту. Вона ввічливо попрощалася з гостями і зникла так швидко, що ніхто не встиг її затримати. Повернувшись додому, дівчина палко подякувала своїй хрещеній матері і сказала, що дуже хотіла б завтра знову поїхати на бал, бо принц запросив її. Чарівниця погодилася.'
     ]],  # 8
    [[1, 1, 1, 1, 1],
     [
         'Та не встигла Попелюшка докладно розповісти хрещеній матері про бал, як у двері постукали це повернулися з королівського палацу мачуха й сестри. - Ой, як же довго ви не поверталися! - сказала Попелюшка, відчинивши двері, позіхаючи й протираючи очі так, ніби щойно прокинулася. Хоч їй, ясна річ, зовсім не хотілося спати... ',
         '- Якби ти була на цьому чарівному балі, - відповіли сестри, - ти б там не занудилася! Туди приїздила незнайома принцеса, найвродливіша в світі! Вона була дуже люб’язна і навіть почастувала нас апельсинами та лимонами. ',
         'Не тямлячи себе з радості, Попелюшка спитала, як звуть ту принцесу. Але сестри відповіли, що ніхто цього не знає і що принц ладен оддати все на світі, аби тільки дізнатися, хто вона така. ',
         '- Невже й справді вона така гарна? - спитала Попелюшка всміхаючись. - Які ж ви щасливі, що бачили її! Якби хоч одним оком глянути на неї!.. Сестрице Жавотт, - мовила вона до старшої сестри, - будь ласка, позичте мені вашу буденну жовту сукню, і я поїду на бал. ',
         '- Овва! - відповіла Жавотт. - Щоб я давала свої сукні якійсь Чорногузці! Я ще не збожеволіла!'
     ]],  # 9
    [[1, 1, 1, 1, 1],
     [
         'Попелюшка тільки того й чекала і аніскілечки не засмутилася, бо що б вона мала робити, якби сестра згодилася дати їй свою сукню? На другий день сестри знову поїхали на бал, і Попелюшка теж, вбрана цього разу ще розкішніше. ',
         'Принц не відходив од неї ні на хвилину і раз у раз говорив їй ніжні слова. Дівчині було так хороше, і вона так щиро веселилася, що геть забула про наказ хрещеної матері. Їй здавалося - до півночі ще ждати і ждати, аж раптом годинник почав бити дванадцять. ',
         'Попелюшка схопилася з місця й побігла з легкістю лісової кізки. ',
         'Принц кинувся за нею, але марно. На сходах Попелюшка загубила один із своїх кришталевих черевичків, і принц шанобливо підібрав його. ',
         'Він підбіг до брами і спитав у вартових, чи не бачили вони, куди поїхала юна принцеса. Але вартові відповіли, що нікого не бачили, крім хіба що якоїсь убогої дівчини, більше схожої на селянку, аніж на принцесу. Не почувши нічого втішного, принц сумно повернувся до палацу. Він думав тільки про те, як розшукати чарівну втікачку.'
     ]],  # 10
    [[1, 1, 1, 1, 1],
     [
         'А Попелюшка прибігла додому зовсім задихана, без карети, без лакеїв, у своїй старій, подертій сукенці. Нічого не залишилося в неї від її розкішного вбрання - тільки один черевичок. Коли сестри приїхали з балу, Попелюшка спитала, чи була там сьогодні прекрасна незнайомка. ',
         'Вони сказали, що була, але зникла, тільки-но почало бити північ, і зникла так швидко, що навіть загубила свій кришталевий черевичок, та такий гарний, що кращого ніколи не було ні в кого у світі. А принц підібрав черевичок прекрасної незнайомки і лише на нього й дивився, бо, певно, дуже закохався в принцесу. ',
         'Вони сказали правду принц і справді покохав красуню. За кілька днів він звелів привселюдно, під звуки фанфар, оголосити, що одружиться з тією дівчиною, на яку прийдеться кришталевий черевичок. Принцові посланці поїхали по всій країні і міряли черевичок спершу принцесам, потім герцогиням, тоді всім дівчатам з вельможних родин, але все було марно. ',
         'Нарешті принесли черевичок і двом Попелющиним сестрам. Та що вони не робили, як не старалися - не взули черевичка, бо він не налазив на їхні ноги. Тоді Попелюшка, яка відразу впізнала свій черевичок, сказала сміючись: - А дайте-но й мені поміряти - може, на мене налізе? ',
         'Сестри зареготали й почали глузувати з неї. Але принців посланець пильно глянув на Попелюшку, побачив, яка вона гарна, і сказав: - Так, хай і вона спробує - адже мені наказано міряти черевичок усім дівчатам. Він посадив Попелюшку на ослінчик і поміряв черевичок на її маленьку ніжку.'
     ]],  # 11
    [[1, 1, 1, 1, 1],
     [
         'І диво! - черевичок озувся так швидко та легко, ніби ніжка тільки того й чекала! Сестри зчудувалися, але коли Попелюшка вийняла з кишені і другий такий черевичок і наділа його на другу ніжну, вони аж уклякли на місці. ',
         'Раптом з’явилася чарівниця, доторкнулася своєю паличною до Попелющиного вбрання, і воно перетворилося на прегарну сукню, ще розкішнішу, ніж та, в якій дівчина була на балі. ',
         'Сестри впізнали в Попелюшці ту красуню, що приїздила в королівський палац. Вони кинулися їй до ніг і благали вибачити за те, що зле з нею поводились і кривдили її. Попелюшка підвела їх і сказала, що вибачає їм од щирого серця і просить наперед завжди її любити. ',
         'Потім Попелюшку повезли до палацу, і принц побачив, що вона ще краща, ніж раніше. За кілька день відгуляли весілля. ',
         'А Попелюшка, така ж добра, як і вродлива, взяла сестер у палац і незабаром оддала їх заміж за двох молодих вельмож.'
     ]]]
