Repository: imiolek-ireneusz/eduActiv8
Catalog: i18n/po/*.po
Languages: ar, es_es, nl, sv

source: To reduce a fraction divide the numerator and the denominator by one of their common factors which are displayed between the two fractions. Select one of them to see what happens. If 1 is the only common factor then the fraction can't be reduced any more - try choosing a different one.
ar: لتبسيط كسر نقسم كل من البسط والمقام بأحد عواملهما المشتركة . حدد أحدهم لمعرفة ما يحدث. إذا كان الرقم 1 هو العامل المشترك الوحيد بين الكسرين ، فلا يمكن تبسيط الكسر أكثر - حاول اختيار عامل مشترك آخر.
es_es: Para reducir una fracción, divide el numerador y el denominador por uno de su factores comunes que se muestran entre las dos fracciones. Selecciona uno de ellos para ver qué sucede. Si 1 es el único factor común, entonces la fracción no puede ser más reducida; intenta elegir otro.
nl: Om een breuk te verkleinen moet de teller en de noemer worden gedeeld door een van de gemeenschappelijke factoren die tussen de twee breuken worden weergegeven. Selecteer één van hen om te zien wat er gebeurt. Als 1 de enige gemeenschappelijke factor is, kan de breuk niet meer worden verkleint - probeer een andere te kiezen.
sv: För att förkorta ett bråk, dela täljaren och nämnaren med en av deras gemensamma faktorer som visas mellan de två bråken. Välj en av dem för att se vad som händer. Om 1 är den enda gemensamma faktorn kan bråket inte förkortas längre - försök att välja en annan.

source: To expand a fraction multiply the numerator and the denominator by the same number. Change the multiplicand to see what happens.
ar: لتكبير الكسر اضرب البسط والمقام بنفس الرقم. قم بتغيير المضروب لمعرفة ما يحدث.
es_es: Para expandir una fracción, multiplica el numerador y el denominador por el mismo número. Cambia el multiplicando para ver qué sucede.
nl: Om een breuk uit te breiden vermenigvuldig je de teller en de noemer met hetzelfde getal. Verander de vermenigvuldiging om te zien wat er gebeurt.
sv: För att expandera ett bråk, multiplicera täljaren och nämnaren med samma tal. Ändra multiplikatorn för att se vad som händer.

source: Use the arrows to change your answer or just type it in.
ar: استخدم الأسهم لتغيير إجابتك أو فقط اكتبها.
es_es: Usa las flechas para cambiar tu respuesta o simplemente escríbela.
nl: Gebruik de pijlen om je antwoord te veranderen of typ het gewoon in.
sv: Använd pilarna för att ändra ditt svar eller skriv det direkt.

source: Use the arrows to change your answer.
ar: استخدم الأسهم لتغيير إجابتك.
es_es: Usa las flechas para cambiar tu respuesta.
nl: Gebruik de pijlen om je antwoord te veranderen.
sv: Använd pilarna för att ändra ditt svar.

source: To add two fractions with the same denominators add their numerators together and keep the denominator unchanged. Simplify the result if the numerator is greater than the denominator and reduce the fraction if possible.
ar: لجمع كسرين لهما نفس المقام قم بإضافة البسط معًا والحفاظ على المقام دون تغيير. بسّط النتيجة إذا كان البسط أكبر من المقام واختصر الكسر إن أمكن.
es_es: Para sumar dos fracciones con los mismos denominadores, suma sus numeradores y mantén el denominador sin cambios. Simplifica el resultado si el numerador es mayor que el denominador y reduce la fracción si es posible.
nl: Om twee breuken met dezelfde noemers op te tellen tel je de tellers bij elkaar op en hou je de noemer ongewijzigd. Vereenvoudig het resultaat als de teller groter is dan de noemer en verklein de breuk indien mogelijk.
sv: För att addera två bråk med samma nämnare, lägg till deras täljare och håll nämnaren oförändrad. Förenkla resultatet om täljaren är större än nämnaren och förkorta bråket om möjligt.

source: To subtract one fraction from another one with the same denominator subtract numerators and keep the denominator unchanged. Reduce the resulting fraction if possible.
ar: لطرح كسرين لهما نفس المقام ، اطرح البسط الاول من الثانى وأبقي المقام دون تغيير. اختصر الكسر الناتج إن أمكن.
es_es: Para restar una fracción de otra con el mismo denominador, resta los numeradores y mantén el denominador sin cambios. Reduce la fracción resultante si es posible.
nl: Om een breuk van een andere breuk met dezelfde noemer af te trekken trek je de teller af en hou je de noemer onveranderd. Verklein de resulterende breuk indien mogelijk.
sv: För att subtrahera ett bråk från ett annat med samma nämnare, subtrahera täljarna och håll nämnaren oförändrad. Förkorta det resulterande bråket om möjligt.

source: To multiply two fractions multiply the numerators together and then multiply the denominators together. Reduce the resulting fraction if possible.
ar: لضرب كسرين ، اضرب البسطين معًا ثم اضرب المقامات معًا. اختزل الكسر الناتج إن أمكن.
es_es: Para multiplicar dos fracciones, multiplica los numeradores entre sí y luego multiplica los denominadores entre sí. Reduce la fracción resultante si es posible.
nl: Om twee breuken te vermenigvuldigen, vermenigvuldig je de tellers met elkaar en vermenigvuldig je vervolgens de noemers met elkaar. Verklein de resulterende breuk indien mogelijk.
sv: För att multiplicera två bråk, multiplicera täljarna med varandra och sedan multiplicera nämnarna med varandra. Förkorta det resulterande bråket om möjligt.

source: To divide a fraction by another fraction multiply the first fraction by the second fraction flipped up side down. Simplify and reduce the resulting fraction if possible.
ar: لقسمة كسر بكسر آخر اضرب الكسر الأول فى مقلوب الكسر الثانى ثم اختصر الكسر الناتج إن أمكن.
es_es: Para dividir una fracción entre otra, multiplica la primera fracción por la segunda fracción invertida. Simplifica y reduce la fracción resultante si es posible.
nl: Om een breuk te delen door een andere breuk vermenigvuldig je de eerste breuk met de tweede breuk naar beneden. Vereenvoudig en verklein de resulterende breuk indien mogelijk.
sv: För att dividera ett bråk med ett annat bråk, multiplicera det första bråket med det andra bråket upp och ner. Förenkla och förkorta det resulterande bråket om möjligt.

source: Group fractions together
ar: جمع الكسور معا
es_es: Agrupar fracciones
nl: Groeperen van breuken
sv: Gruppera bråk tillsammans

source: Group percentages together
ar: جمع النسب المئوية مع بعضها
es_es: Agrupar porcentajes
nl: Groepspercentages samen
sv: Gruppera procent tillsammans

source: Group ratios together
ar: جمع النسب مع بعضها
es_es: Agrupar proporciones
nl: Groepsverhoudingen samen
sv: Gruppera förhållanden tillsammans

source: Symmetry
ar: تماثل
es_es: Simetría
nl: Symmetrie
sv: Symmetri

source: Reflection Symmetry - draw with shapes
ar: الانعكاس المتمائل - ارسم بالأشكال
es_es: Simetría de reflexión - dibujar con formas
nl: Reflectiesymmetrie - tekenen met vormen
sv: Reflexiv symmetri - rita med former

source: Reflect shapes
ar: اعكس الاشكال
es_es: Reflejar formas
nl: Reflecterende vormen
sv: Spegelvänd former

source: Reflect a shape in a mirror line
ar: انعكاس شكل في خط معكوس
es_es: Reflejar una forma en una línea de espejo
nl: Reflecteer een vorm in een spiegellijn
sv: Spegelvänd en form i en spegelaxel

source: Draw a shape that is a reflection of the one already displayed. The red line is the mirror line.
ar: ارسم شكلاً يعكس الشكل المعروض امامك. الخط الأحمر هو خط المرآة.
es_es: Dibuja una forma que sea un reflejo de la que ya está mostrada. La línea roja es la línea de espejo.
nl: Teken een vorm die een weerspiegeling is van de reeds getoonde vorm. De rode lijn is de spiegellijn.
sv: Rita en form som är en spegelbild av den redan visade. Den röda linjen är spegelaxeln.

source: Symmetrical shapes - missing half
ar: اشكال متماثلة ..النصف مفقود
es_es: Formas simétricas - mitad faltante
nl: Symmetrische vormen - ontbrekende helft
sv: Symmetriska former - saknas ena halvan

source: Draw the other half of the shape
ar: ارسم النصف الاخر من الشكل
es_es: Dibuja la otra mitad de la forma
nl: Teken de andere helft van de vorm
sv: Rita den andra halvan av formen

source: Find lines of symmetry
ar: اوجد خط التماثل
es_es: Encontrar líneas de simetría
nl: Zoek lijnen van symmetrie
sv: Hitta symmetrilinjer

source: Find and select all lines of symmetry for a displayed shape. Click on the arrows around the drawing area to select them.
ar: اوجد جميع خطوط التناظر للشكل الموضح. انقر فوق الأسهم الموجودة حول منطقة الرسم لتحديدها.
es_es: Encuentra y selecciona todas las líneas de simetría para una forma mostrada. Haz clic en las flechitas alrededor del área de dibujo para seleccionarlas.
nl: Zoek en selecteer alle lijnen van symmetrie voor een weergegeven vorm. Klik op de pijlen rond het tekengebied om ze te selecteren.
sv: Hitta och välj alla symmetrilinjer för en visad form. Klicka på pilarna runt ritområdet för att välja dem.

source: Match equivalent fractions
ar: طابق الكسور المتساوية
es_es: Emparejar fracciones equivalentes
nl: Overeenkomen met equivalente breuken
sv: Matcha ekvivalenta bråk

source: Match fractions
ar: طابق الكسور
es_es: Emparejar fracciones
nl: Koppel breuken
sv: Matcha bråk

source: Match decimals
ar: طابق الارقام العشرية
es_es: Emparejar decimales
nl: Koppel decimalen
sv: Matcha decimaltal

source: Match percentages
ar: طابق النسب المئوية
es_es: Emparejar porcentajes
nl: Koppel percentages
sv: Matcha procent

source: Match ratios
ar: طابق النسب
es_es: Emparejar proporciones
nl: Koppel verhoudingen
sv: Matcha förhållanden

source: Percentages in a pie chart
ar: النسب المئوية في مخطط دائري
es_es: Porcentajes en un gráfico circular
nl: Percentages in een taartdiagram
sv: Procent i ett cirkeldiagram

source: Find equivalent fraction
ar: اوجد مكافئ الكسر
es_es: Encontrar fracción equivalente
nl: Zoek een gelijkwaardige breuk
sv: Hitta ekvivalent bråk

source: Calculating with Time
ar: احسب الوقت
es_es: Cálculos con el tiempo
nl: Berekenen met de tijd
sv: Beräkningar med tid

source: start time
ar: زمن البدأ
es_es: hora de inicio
nl: starttijd
sv: starttid

source: end time
ar: زمن النهاية
es_es: hora de finalización
nl: eindtijd
sv: sluttid

source: elapsed time
ar: الوقت المنقضي
es_es: tiempo transcurrido
nl: verlopen tijd
sv: förfluten tid

source: Temperature - introduction to negative numbers
ar: درجات الحرارة - مقدمة الى الاعداد السالبة
es_es: Temperatura - introducción a los números negativos
nl: Temperatuur - inleiding tot negatieve getallen
sv: Temperatur - introduktion till negativa tal

source: Experiment with elapsed time
ar: تمارين على الوقت المنقضي
es_es: Experimentar con el tiempo transcurrido
nl: Experimenteren met verstreken tijd
sv: Experimentera med förfluten tid

source: Experiment with elapsed time 2
ar: تمارين على الوقت المنقضي - 2
es_es: Experimentar con el tiempo transcurrido 2
nl: Experimenteren met verstreken tijd 2
sv: Experimentera med förfluten tid 2

source: Calculate elapsed time
ar: احسب الوقت المنقضي
es_es: Calcular el tiempo transcurrido
nl: Bereken de verstreken tijd
sv: Beräkna förfluten tid

source: Find the start or the end time
ar: اوجد زمن البداية او النهاية
es_es: Encontrar la hora de inicio o finalización
nl: Zoek de begin- of eindtijd
sv: Hitta start- eller sluttid

source: Visualized on a clock dial
ar: وضح على قرص الساعه
es_es: Visualizado en un reloj
nl: Gevisualiseerd op een wijzerplaat voor de klok
sv: Visualiserad på en klockskiva

source: Visualized on a number line
ar: وضح على خط الاعداد
es_es: Visualizado en una recta numérica
nl: Gevisualiseerd op een nummerlijn
sv: Visualiserad på en talinje

source: Visualized on two number lines
ar: وضح على خطى الاعداد
es_es: Visualizado en dos rectas numéricas
nl: Gevisualiseerd op twee cijferregels
sv: Visualiserad på två tallinjer

source: With no visualizations
ar: بدون توضيح
es_es: Sin visualizaciones
nl: Zonder visualisaties
sv: Utan visualiseringar

source: With mirrored images
ar: مع صور معكوسة
es_es: Con imágenes reflejadas
nl: Met gespiegelde beelden
sv: Med spegelbilder

source: Theme Editor
ar: محرر النمط
es_es: Editor de temas
nl: Thema-editor
sv: Temaredigerare

source: Make the game look your way
ar: نسق اللعبة باسلوبك
es_es: Haz que el juego se vea a tu manera
nl: Laat het spel er op jouw manier uitzien
sv: Gör spelet som du vill

source: Reset colors back to the default ones?
ar: هل ترغب باستعادة الالوان الافتراضية ؟
es_es: ¿Restaurar los colores a los predeterminados?
nl: De kleuren terugzetten naar de standaard kleuren?
sv: Återställ färgerna till standardfärgerna?

source: With simplifying
ar: مع التبسيط
es_es: Con simplificación
nl: Met het vereenvoudigen van
sv: Med förenkling

source: Positive numbers
ar: ارقام موجبة
es_es: Números positivos
nl: Positieve cijfers
sv: Positiva tal

source: Basics
ar: الاساسيات
es_es: Conceptos básicos
nl: Basis
sv: Grunder

source: Equivalent fractions
ar: الكسور المكافئة
es_es: Fracciones equivalentes
nl: Gelijkwaardige breuken
sv: Ekvivalenta bråk

source: Expanding and reducing fractions
ar: تكبير الكسور واختصارها
es_es: Expansión y reducción de fracciones
nl: Uitbreiding en vermindering van breuken
sv: Expandera och förkorta bråk

source: Add fractions with unlike denominators
ar: جمع الكسور ذات المقامات الغير متساوية
es_es: Sumar fracciones con denominadores diferentes
nl: Breuken toevoegen met andere dan de noemers
sv: Lägg till bråk med olika nämnare

source: Subtract fractions with unlike denominators
ar: طرح الكسور ذات المقامات الغير متساوية
es_es: Restar fracciones con denominadores diferentes
nl: Aftrekken van breuken met andere dan de noemers
sv: Subtrahera bråk med olika nämnare

source: To add or subtract fractions when their denominators are not the same you have to find equivalent fractions which do have a common denominator. Finding the least common multiple of the two denominators will help you with that.
ar: لجمع أو طرح الكسور عندما لا تكون مقاماتها متساوية ، يجب عليك العثور على الكسور المتكافئة التي لها قاسم مشترك. سيساعدك العثور على المضاعف المشترك الأدنى من المقامات في ذلك.
es_es: Para sumar o restar fracciones cuando sus denominadores no son iguales, debes encontrar fracciones equivalentes que sí tengan un denominador común. Encontrar el mínimo común múltiplo de los dos denominadores te ayudará con eso.
nl: Om breuken toe te voegen of af te trekken wanneer hun noemers niet dezelfde zijn, moet je equivalente fracties vinden die wel een gemeenschappelijke noemer hebben. Het vinden van het kleinste gemene veelvoud van de twee noemers zal je daarbij helpen.
sv: För att lägga till eller subtrahera bråk när deras nämnare inte är samma, måste du hitta ekvivalenta bråk som har en gemensam nämnare. Att hitta det minsta gemensamma multiplet av de två nämnarna kommer att hjälpa dig med det.

source: long form
ar: الصورة المطولة
nl: lange vorm
sv: lång form

source: short form
ar: الصورة المختصرة
nl: korte vorm
sv: kort form

source: white
ar: ابيض
es_es: blanco
nl: wit
sv: vit

source: black
ar: اسود
es_es: negro
nl: zwart
sv: svart

source: grey
ar: رمادى
es_es: gris
nl: grijs
sv: grå

source: red
ar: أحمر
es_es: rojo
nl: rood
sv: röd

source: orange [color]
ar: برتقالى (لون )
es_es: naranja
nl: oranje [kleur]
sv: orange

source: yellow
ar: اصفر
es_es: amarillo
nl: geel
sv: gul

source: olive
ar: زيتون
es_es: verde oliva
nl: olijf
sv: oliv

source: green
ar: أخضر
es_es: verde
nl: groene
sv: grön

source: sea green
ar: أخضر بحرى
es_es: verde mar
nl: zeegroen
sv: havsgrön

source: teal
ar: بط نهري صغير
es_es: verde azulado
sv: blågrön

source: blue
ar: أزرق
es_es: azul
nl: blauw
sv: blå

source: navy
ar: القوات البحرية
es_es: azul marino
nl: marine blauw
sv: marinblå

source: purple
ar: ارجوانى
es_es: púrpura
nl: paars
sv: lila

source: violet
ar: بنفسجى
es_es: violeta
sv: violett

source: magenta
ar: ارجوانى( فوشيا )

source: indigo
ar: ازرق نيلى
es_es: añil

source: pink
ar: وردى
es_es: rosa
nl: roze
sv: rosa

source: maroon
ar: كستنائي
es_es: granate
nl: kastanjebruin
sv: kastanjebrun

source: brown
ar: بنى
es_es: marrón
nl: bruine
sv: brun

source: aqua
ar: مائي
es_es: ciano
sv: akvamarin

source: lime
ar: ليمون
es_es: lima
nl: limoen groen

source: Equilateral Triangle
ar: مثلث متساوي الاضلاع
es_es: Triángulo equilátero
nl: Equilaterale Driehoek
sv: Likbent triangel

source: Isosceles Triangle
ar: مثلث متساوي الساقين
es_es: Triángulo isósceles
nl: Gelijkbenige driehoek
sv: Likbent triangel

source: Obtuse Triangle
ar: مثلث منفرج الزاوية
es_es: Triángulo obtuso
nl: Stomp driehoek
sv: Trubbig triangel

source: Right Triangle
ar: مثلث قائم الزاوية
es_es: Triángulo rectángulo
nl: Rechtse driehoek
sv: Rätvinklig triangel

source: Acute Triangle
ar: مثلث حاد الزوايا
es_es: Triángulo agudo
nl: Acute Driehoek
sv: Spetsig triangel

source: Square
ar: مربع
es_es: Cuadrado
nl: Vierkant
sv: Kvadrat

source: Rectangle
ar: مستطيل
es_es: Rectángulo
nl: Rechthoek
sv: Rektangel

source: Right Trapezium
ar: شبه منحرف عمودى
es_es: Trapecio rectángulo
nl: Rechts Trapezium
sv: Rätvinkligt trapezoid

source: Isosceles Trapezium
ar: شبه منحرف متساوى الساقين
es_es: Trapecio isósceles
sv: Likbent trapezoid

source: Rhombus
ar: معين
es_es: Rombo
sv: Romb

source: Parallelogram
ar: متوازي الاضلاع
es_es: Paralelogramo
sv: Parallellogram

source: Pentagon
ar: شكل خماسى الاضلاع
es_es: Pentágono
nl: Vijfhoek
sv: Femhörning

source: Hexagon
ar: شكل سداسى الاضلاع
es_es: Hexágono
nl: Zeshoek
sv: Sexhörning

source: Heptagon
ar: شكل سباعى الاضلاع
es_es: Heptágono
nl: Zevenhoek
sv: Sjuhörning

source: Octagon
ar: شكل ثمانى الاضلاع
es_es: Octágono
nl: Achthoek
sv: Åttahörning

source: Circle
ar: دائرة
es_es: Círculo
nl: Cirkel
sv: Cirkel

source: Ellipse
ar: شكل بيضاوى - قطع ناقص
es_es: Elipse
sv: Ellips

source: Cube
ar: مكعب
es_es: Cubo
nl: Kubus
sv: Kub

source: Square Prism
ar: منشور ذو قاعدة مربعه
es_es: Prisma cuadrado
nl: Vierkant Prisma
sv: Kvadratprism

source: Triangular Prism
ar: منشور ذو قاعدة مثلثة
es_es: Prisma triangular
nl: Driehoekig prisma
sv: Triangulärt prism

source: Square Pyramid
ar: هرم ذو قاعدة مربعه
es_es: Pirámide de base cuadrada
nl: Vierkante Piramide
sv: Kvadratpyramid

source: Triangular Pyramid
ar: هرم ذو قاعدة مثلثة
es_es: Pirámide de base triangular
nl: Driehoekige piramide
sv: Triangulär pyramid

source: Sphere
ar: شكل كروى
es_es: Esfera
nl: Bol
sv: Sfär

source: Cylinder
ar: أسطوانة
es_es: Cilindro
nl: Cilinder
sv: Cylindrar

source: Cone
ar: مخروط
es_es: Cono
nl: Kegel
sv: Kon

source: Torus
ar: نتوء مستدير
es_es: Toro

source: Quadrilateral
ar: رباعي الاضلاع
es_es: Cuadrilátero
nl: Quadrilateraal
sv: Fyrahörning

source: Trapezium
ar: شبه منحرف
es_es: Trapecio
sv: Trapezoid

source: Triangle
ar: مثلث
es_es: Triángulo
nl: Driehoek
sv: Triangel

source: Ouch... squished quadrilateral
ar: عذرًا ... رباعي الأضلاع
es_es: cuadrilátero 'aplastado'
nl: Auw... geplet vierzijdig...
sv: Aj... krossad fyrhörning

source: Right isosceles triangle
ar: مثلث قائم ومتساوى الساقين
es_es: Triángulo isósceles rectángulo
nl: Rechter gelijkbenige driehoek
sv: Rätvinklig likbent triangel

source: Obtuse isosceles triangle
ar: مثلث متساوي الساقين
es_es: Triángulo isósceles obtuso
nl: Stomp gelijkbenige driehoek
sv: Trubbig likbent triangel

source: Acute isosceles triangle
ar: مثلث حاد الزاوية متساوي الساقين
es_es: Triángulo isósceles agudo
nl: Acute gelijkbenige driehoek
sv: Spetsig likbent triangel

source: Ouch... squished triangle
ar: أوه... مثلث مضغوط جدًا
es_es: Vaya... Triángulo 'aplastado'
nl: Auw... geplette driehoek
sv: Aj... krossad triangel

source: Triangle? Well, not really...
ar: هل هذا مثلث ؟ حسنا ..لا للاسف
es_es: ¿Triángulo? Bueno, realmente no...
nl: Driehoek? Nou, niet echt...
sv: Triangel? Tja, inte riktigt...

source: area:
ar: المساحة
es_es: área:
nl: gebied:
sv: yta:

source: perimeter:
ar: المحيط :
es_es: perímetro:
sv: omkrets:

source: circumference:
ar: محيط الشكل
es_es: circunferencia:
nl: omtrek:
sv: omkrets:

source: surface area:
ar: مساحة السطح :
es_es: área de la superficie:
nl: oppervlakte:
sv: ytarea:

source: volume:
ar: الحجم :
es_es: volumen:
sv: volym:

source: green apple
ar: تفاحات خضراء
es_es: manzana verde
nl: groene appel
sv: grön äpple

source: red apple
ar: تفاحات حمراء
es_es: manzana roja
nl: rode appel
sv: röd äpple

source: strawberry
ar: تفاحات حمراء
es_es: fresa
nl: aardbei
sv: jordgubbe

source: pear
ar: كمثرى
es_es: pera
nl: peer
sv: päron

source: orange [fruit]
ar: برتقالات
es_es: naranja
nl: sinaasappel [fruit]
sv: apelsin

source: onion
ar: بصل
es_es: cebolla
nl: ui
sv: lök

source: tomato
ar: طماطم
es_es: tomate
nl: tomaat
sv: tomat

source: lemon
ar: ليمونات
es_es: limón
nl: citroen
sv: citron

source: cherry
ar: كرز
es_es: cereza
nl: kers
sv: körsbär

source: pepper
ar: فلفل
es_es: pimiento
nl: paprika
sv: peppar

source: carrot
ar: جزر
es_es: zanahoria
nl: wortel
sv: morot

source: banana
ar: موز
es_es: plátano
nl: banaan
sv: banan

source: watermelon
ar: بطيخ
es_es: sandía
nl: watermeloen
sv: vattenmelon

source: hour
ar: ساعات
es_es: hora
nl: uur
sv: timme

source: minute
ar: دقائق
es_es: minuto
nl: minuut
sv: minut

source: divided by
es_es: dividido entre
nl: gedeeld door
sv: delat med
