Repository: imiolek-ireneusz/eduActiv8
Catalog: i18n/po/*.po
Languages: ar, es_es, nl, sv

source: Find the colour of the circle in the middle
ar: ابحث عن لون الدائرة الموجودة بالمنتصف
es_es: Encuentra el color del círculo
nl: Zoek de kleur van de cirkel in het midden
sv: Hitta färgen på cirkeln i mitten

source: Adjust the amount of cyan, magenta and yellow paint
ar: اضبط كمية الطلاء السماوي والأرجواني والأصفر
es_es: Ajusta la cantidad de pintura ciano, magenta y amarilla
nl: Pas de hoeveelheid cyaan, magenta en gele verf aan
sv: Justera mängden cyan, magenta och gul färg

source: Adjust the intensity of red, green and blue light
ar: اضبط شدة الضوء الأحمر والأخضر والأزرق
es_es: Ajusta la intensidad de la luz roja, verde y azul
nl: Pas de intensiteit van het rode, groene en blauwe licht aan
sv: Justera intensiteten på rött, grönt och blått ljus

source: Match Animals
ar: طابق الحيوانات
es_es: Empareja los animales
nl: Wedstrijddieren
sv: Para ihop djur

source: Find all matching animals
ar: البحث عن جميع الحيوانات المطابقة
es_es: Encuentra todos los animales que coinciden
nl: Vind alle passende dieren
sv: Hitta alla matchande djur

source: Match animals to their shadows
ar: طابق الحيوانات بظلالها
es_es: Empareja los animales con sus sombras
nl: Dieren aan te passen aan hun schaduwen
sv: Matcha djur med deras skuggor

source: Match Animals - Memory Game
ar: مطابقةالحيوانات - لعبة الذاكرة
es_es: Empareja los animales
nl: Wedstrijd Dieren - Geheugenspel
sv: Para ihop djur – memoryspel

source: Match Fruits - Memory Game
ar: مطابقة الفواكه - لعبة الذاكرة
es_es: Empareja las frutas
nl: Wedstrijd Fruit - Geheugenspel
sv: Para ihop frukter – memoryspel

source: Match Vegetables - Memory Game
ar: مطابقة الخضروات- لعبة الذاكرة
es_es: Empareja los vegetales
nl: Wedstrijd Groenten - Geheugenspel
sv: Para ihop grönsaker – memoryspel

source: Match Numbers - Memory Game
ar: مطابقة الارقام - لعبة الذاكرة
es_es: Empareja los números
nl: Wedstrijdnummers - Geheugenspel
sv: Para ihop siffror – memoryspel

source: Find matching pairs of the same image
ar: ابحث عن أزواج متطابقة من نفس الصورة
es_es: Encuentra las parejas de la misma imagen
nl: Zoek overeenkomende paren van dezelfde afbeelding
sv: Hitta matchande par av samma bild

source: Image Slider
ar: تحريك الصورة
es_es: Imágenes troceadas
nl: Beeldschuif
sv: Bildpussel

source: Animal Slider
ar: تحريك الحبوانات
es_es: Animales
nl: Dierenschuif
sv: Djurpussel

source: Fruit Slider
ar: تحريك الفواكه
es_es: Frutas
nl: Fruitschuif
sv: Fruktpussel

source: Number Slider
ar: تحريك الارقام
es_es: Números
nl: Nummer Schuifregelaar
sv: Sifferpussel

source: Maths Matching Game
ar: لعبة مطابقة الرياضيات
es_es: Empareja los números
sv: Matematikmatchningsspel

source: Addition
ar: الجمع
es_es: Suma
nl: Optelling

source: Subtraction
ar: الطرح
es_es: Resta
nl: Aftrekken
sv: Subtraktion

source: Multiplication
ar: الضرب
es_es: Multiplicación
nl: Vermenigvuldiging
sv: Multiplikation

source: Fractions
ar: الكسور
es_es: Fracciones
nl: Delingen
sv: Bråktal

source: Decimal Fractions
ar: الكسور العشرية
es_es: Fracciones decimales
nl: Decimale Fracties
sv: Decimaltal

source: Percentages
ar: النسب المئوية
es_es: Porcentajes
sv: Procent

source: Ratios
ar: النسبة والتناسب
es_es: Relaciones
nl: Verhoudingen
sv: Förhållanden

source: Fraction Groups
ar: مجموعات كسرية
es_es: Grupos de fracciones
nl: Fractionele groepen
sv: Bråkgrupper

source: Type your answer and hit enter
ar: اكتب الاجابة واضغط على مفتاح الادخال
es_es: Escribe tu respuesta y pulsa intro
nl: Typ uw antwoord en druk op enter
sv: Skriv ditt svar och tryck på enter

source: Decimals (Category)
ar: الكسور العشرية
es_es: Decimales
nl: Decimalen (Categorie)
sv: Decimaltal (kategori)

source: Fractions (Category)
ar: الكسور
es_es: Fracciones
nl: Fracties
sv: Bråktal (kategori)

source: Ratios (Category)
ar: النسب
es_es: Proporciones
nl: Verhoudingen
sv: Förhållanden (kategori)

source: Percentages (Category)
ar: النسب المئوية
es_es: Porcentajes
nl: Percentages
sv: Procent (kategori)

source: Learn new words
ar: تعلم كلمات جديدة
es_es: Aprender nuevas palabras
nl: Leer nieuwe woorden
sv: Lär dig nya ord

source: Word Builders
ar: منشئ الكلمات
es_es: Constructor de palabras
nl: Woordbouwers
sv: Ordbyggare

source: Word Matchers
ar: مطابقة الكلمات
es_es: El significado de las imágenes
nl: Woorden koppelen
sv: Ordmatchare

source: Match images to words
ar: طابق الصور مع الكلمات
es_es: Empareja imágenes con las palabras
nl: Afbeeldingen en woorden koppelen
sv: Matcha bilder med ord

source: Animals
ar: حيوانات
es_es: Animales
nl: Dieren
sv: Djur

source: Sports
ar: الالعاب
es_es: Deportes
nl: Sport
sv: Sport

source: Body
ar: الجسم
es_es: El cuerpo
nl: Lichaam
sv: Kropp

source: People
ar: الاشخاص
es_es: Gente
nl: Mensen
sv: Personer

source: Actions
ar: الافعال
es_es: Acciones
nl: Acties
sv: Handlingar

source: Constructions
ar: اعمال البناء
es_es: Construcciones
nl: Bouwwerken
sv: Byggnader

source: Nature
ar: الطبيعة
es_es: Naturaleza
nl: Natuur
sv: Natur

source: Jobs
ar: المهن والوظائف
es_es: Trabajos
nl: Werk
sv: Yrken

source: Clothes and Accessories
ar: الملابس والاكسسوارات
es_es: Ropa y accesorios
nl: Kleding en accessoires
sv: Kläder och tillbehör

source: Fruits and Vegetables
ar: الفواكه والخضراوات
es_es: Frutas y vegetales
nl: Groenten en fruit
sv: Frukter och grönsaker

source: Transport
ar: المواصلات
es_es: Transporte

source: Food
ar: الطعام
es_es: Comida
nl: Voeding
sv: Mat

source: Listening Exercises
ar: تمارين الاستماع
es_es: Ejercicios de escucha
nl: Luisteroefeningen
sv: Lyssningsövningar

source: Match sounds to words
ar: مطابقة الأصوات للكلمات
es_es: Emparejar sonidos con palabras
nl: Geluiden en woorden koppelen
sv: Matcha ljud med ord

source: Patterns
ar: الانماط
es_es: Patrones
nl: Patronen
sv: Mönster

source: Number Patterns
ar: أنماط رقمية
es_es: Patrones numéricos
nl: Aantal Patronen
sv: Siffermönster

source: Letter Patterns
ar: أنماط حرفية
es_es: Patrones de letras
nl: Brief patronen
sv: Bokstavsmönster

source: Color Patterns
ar: أنماط لونية
es_es: Patrones de colores
nl: Kleurpatronen
sv: Färgmönster

source: Image Patterns
ar: انماط الصور
es_es: Patrones de imágenes
nl: Beeldpatronen
sv: Bildmönster

source: Fraction Patterns
ar: انماط الكسور
es_es: Patrones de fracciones
nl: Fractiepatronen
sv: Bråkmönster

source: Shape Patterns
ar: انماط الاشكال
es_es: Patrones de formas
nl: Vormpatronen
sv: Formmönster

source: Complete the pattern on the top line.
ar: أكمل النمط في السطر العلوي.
es_es: Completa el patrón en la línea superior.
nl: Maak het patroon op de bovenste lijn af.
sv: Fyll i mönstret på översta raden.

source: Match shapes to their names
ar: طابق الأشكال مع أسمائهم
es_es: Empareja las formas con sus nombres
nl: Pas de vormen aan hun naam aan
sv: Matcha former med deras namn

source: Negative numbers
ar: الأعداد السالبة
es_es: Números negativos
nl: Negatieve cijfers
sv: Negativa tal

source: Complete the alphabet using letters from the middle line.
ar: أكمل الأبجدية باستخدام أحرف من الخط الأوسط.
es_es: Completa el alfabeto usando las letras de la línea del medio.
nl: Vul het alfabet in met de letters van de middelste regel.
sv: Fyll i alfabetet med bokstäver från den mittersta raden.

source: Drag the slider up or down so that the right sign is in the red square.
ar: اسحب المنزلق لأعلى أو لأسفل بحيث تكون العلامة اليمنى في المربع الأحمر.
es_es: Mueve arriba o abajo y pon el símbolo adecuado en el cuadrado rojo.
nl: Sleep de schuifregelaar omhoog of omlaag zodat het juiste teken in het rode vierkant staat.
sv: Dra reglaget upp eller ner så att rätt tecken hamnar i den röda rutan.

source: Take your sheep to the rest of the herd.
ar: خذ خرافك إلى بقية القطيع.
es_es: Lleva tu oveja hasta donde está el resto del rebaño.
nl: Breng je schapen naar de rest van de kudde.
sv: Följ fåret till resten av flocken.

source: Check the shopping list and drag all needed items into the basket.
ar: تحقق من قائمة التسوق واسحب جميع العناصر المطلوبة في السلة.
es_es: Comprueba la lista de la compra y arrastra dentro de la cesta todas las cosas necesarias.
nl: Controleer het boodschappenlijstje en sleep alle benodigde artikelen in het mandje.
sv: Kontrollera inköpslistan och dra alla nödvändiga saker till korgen.

source: Drag one of the <, > or = (lesser, greater or equal) to the red square.
ar: اسحب أحد الرموز <أو > أو = (أقل أو أكبر أو يساوي) إلى المربع الأحمر.
es_es: Arrastra hasta el cuadrado rojo: <, > ó = (menor, mayor, o igual que).
nl: Sleep een van de <, > of = (kleiner, groter of gelijk) naar het rode vierkant.
sv: Dra ett av <, > eller = (mindre än, större än eller lika med) till den röda rutan.

source: Drag one of the lesser, greater or equal to the red square.
ar: السحب واحدة من أقل أكبر أو يساوي إلى المربع الاحمر
es_es: Arrastra hasta el cuadrado rojo uno de los símbolos de menor que, mayor que, o igual.
nl: Sleep een van de minder, groter of gelijk aan het rode vierkant.
sv: Dra ett av mindre än, större än eller lika med till den röda rutan.

source: Rearrange the numbers so they are in the right order.
ar: أعد ترتيب الأرقام بحيث تكون بالترتيب الصحيح.
es_es: Reordena los números de arriba para que estén en el orden correcto.
nl: Schik de nummers in de juiste volgorde.
sv: Ordna siffrorna så att de är i rätt ordning.

source: Build the following word using the letters below.
ar: قم ببناء الكلمة التالية باستخدام الحروف أدناه.
es_es: Construye las siguientes palabras usando las letras inferiores.
nl: Bouw het volgende woord op met behulp van de onderstaande letters.
sv: Bygg följande ord med hjälp av bokstäverna nedan.

source: Find and separate even numbers from odd numbers.
ar: ابحث عن الأرقام الزوجية وافصلها عن الأرقام الفردية.
es_es: Encuentra y separa los números pares de los números impares en la serie de arriba.
nl: Zoek en scheid de even nummers van oneven nummers.
sv: Hitta och skilj på jämna och udda tal.

source: Rearrange the letters so they are in the alphabetical order.
ar: إعادة ترتيب الحروف حسب الترتيب الأبجدي.
es_es: Reordena las letras de arriba para que estén en orden alfabético.
nl: Rangschik de letters in de alfabetische volgorde.
sv: Ordna bokstäverna i alfabetisk ordning.

source: Rearrange the numbers so they are in the ascending order.
ar: أعد ترتيب الأرقام بحيث تكون بالترتيب التصاعدي.
es_es: Reordena los números de arriba para que estén en orden ascendente.
nl: Rangschik de getallen in oplopende volgorde.
sv: Ordna siffrorna i stigande ordning.

source: Perfect! Task solved!
ar: رائع ! تم حل المهمة!
es_es: ¡Perfecto! ¡Tarea solucionada!
nl: Perfect! Opdracht opgelost!
sv: Perfekt! Uppgiften löst!

source: Game Over!
ar: انتهت اللعبة
es_es: ¡Fin del juego!
sv: Spelet är slut!

source: Congratulations! You have completed all tasks in this game.
ar: تهانينا! لقد أكملت جميع المهام في هذه اللعبة.
es_es: ¡Enhorabuena! Has terminado todas las actividades en este juego.
nl: Gefeliciteerd! Je hebt alle taken in dit spel voltooid.
sv: Grattis! Du har slutfört alla uppgifter i det här spelet.

source: Great job!
ar: اداء رائع
es_es: ¡Buen trabajo!
nl: Geweldig gedaan!
sv: Bra jobbat!

source: Perfect!!!
ar: ممتاز
es_es: ¡Perfecto!
sv: Perfekt!!!

source: Awesome!
ar: رائع
es_es: ¡Maravilloso!
nl: Geweldig!
sv: Fantastiskt!

source: Fantastic job!
ar: عمل مبهر
es_es: ¡Genial!
nl: Fantastisch werk!
sv: Fantastiskt bra jobbat!

source: Well done!
ar: أحسنت
es_es: ¡Bien hecho!
nl: Goed gedaan!
sv: Snyggt jobbat!

source: Perfect! Level completed!
ar: رائع ! انتهى المستوى!
es_es: ¡Perfecto! ¡Nivel terminado!
nl: Perfect! Level voltooid!
sv: Perfekt! Nivån klar!

source: Perfect!
ar: ممتاز
es_es: ¡Perfecto!
sv: Perfekt!

source: times
ar: مرات
es_es: multiplicado por
nl: keer
sv: gånger

source: equals
ar: يساوى
es_es: es igual a
nl: is gelijk aan
sv: är lika med

source: brush size
ar: حجم الفرشاة
es_es: tamaño de la brocha
nl: borstelgrootte
sv: penselstorlek

source: Match fraction charts on the right to the ones on the left
ar: تطابق مخططات الكسر على اليمين إلى تلك الموجودة على اليسار
es_es: Empareja las imágenes de la derecha con las de la izquierda
nl: De rechter- en linkerfractiegrafieken zijn gelijk aan de linkerfractiegrafieken.
sv: Matcha bråkscheman till höger med de till vänster

source: Match fraction charts and fractions on the right to the fraction charts on the left
ar: تطابق مخططات الكسور والكسور الموجودة على اليمين مع مخططات الكسور الموجودة على اليسار
es_es: Empareja las imágenes y las fracciones de la derecha con las imágenes de la izquierda
nl: Vergelijk de breukgrafieken en breuken rechts met de breukgrafieken links.
sv: Matcha bråkscheman och bråk till höger med bråkscheman till vänster

source: Match fraction charts to the fractions on the left
ar: طابق مخططات الكسور مع الكسور الموجودة على اليسار
es_es: Empareja las imágenes con las fracciones de la izquierda
nl: Vergelijk de breukgrafieken met de breuken aan de linkerkant.
sv: Matcha bråkscheman med bråken till vänster

source: Match fraction charts, fractions and decimal fractions on the right to their percentage representations
ar: مطابقة مخططات الكسور والكسور والكسور العشرية على اليمين لتمثيلاتها المئوية
es_es: Empareja las imágenes, fracciones y números decimales de la derecha con sus representaciones en forma de porcentaje
nl: Vergelijking van breukgrafieken, breuken en decimale breueken rechts van hun procentuele weergaven
sv: Matcha bråkscheman, bråk och decimaltal till höger med deras procentform

source: Match charts to the ratios on the left. Ratios are expressed as ratio of coloured pieces to white pieces
ar: تطابق المخططات للنسب على اليسار. يتم التعبير عن النسب كنسبة من القطع الملونة إلى القطع البيضاء
es_es: Empareja las gráficas con las relaciones de la izquierda expresadas como una proporción entre partes coloreadas y partes blancas
nl: Vergelijk de grafieken met de verhoudingen aan de linkerkant. De verhoudingen worden uitgedrukt als de verhouding tussen de gekleurde stukken en de witte stukken.
sv: Matcha diagram med förhållandena till vänster. Förhållandena anges som förhållandet mellan färgade och vita delar

source: Shape Maker
ar: صانع الاشكال
es_es: Creador de figuras
nl: Vorm maker
sv: Formskapare

source: Let's see what shapes you can draw
ar: دعنا نرى الأشكال التي يمكنك رسمها
es_es: Veamos qué figuras puedes dibujar
nl: Laten we eens kijken welke vormen je kunt tekenen
sv: Låt oss se vilka former du kan rita

source: Shape to draw: %s
ar: %s :الشكل المراد رسمه
es_es: Figura a dibujar: %s
nl: Te tekenen vorm: %s
sv: Form att rita: %s

source: such that lengths of its bases are equal to %d and %d and height to %d
ar: %d والارتفاع إلى %d و %d بحيث تكون أطوال قواعده تساوي
es_es: las longitudes de sus bases sean iguales a %d y a %d y que su altura sea igual a %d
nl: zodanig dat de lengte van de basis gelijk is aan %d en %d en de hoogte aan %d
sv: så att längderna på dess baser är %d och %d och höjden är %d

source: such that lengths of its sides are equal to %d
ar: %d بحيث تكون أطوال أضلاعه تساوي
es_es: la longitud de sus lados sea igual a %d
nl: zodanig dat de lengte van de zijden gelijk is aan %d
sv: så att sidorna är %d långa

source: such that lengths of its sides are equal to %d and %d
ar: %d و %d بحيث تكون أطوال أضلاعه تساوي
es_es: las longitudes de sus lados sean iguales a %d y %d
nl: zodanig dat de lengte van de zijden gelijk is aan %d en %d
sv: så att sidorna är %d och %d långa

source: such that lengths of its 2 parallel bases are equal to %d and height to %d
ar: %d والارتفاع إلى %d بحيث تكون أطوال قاعدتيه المتوازيتين تساوي
es_es: la longitud de sus dos bases paralelas sea igual a %d y que su altura sea igual a %d
nl: zodanig dat de lengte van de 2 parallelle bodems gelijk is aan %d en de hoogte aan %d
sv: så att längderna på de två parallella baserna är %d och höjden är %d

source: such that length of its base is equal to %d and height to %d
ar: %d والارتفاع إلى %d بحيث أن طول قاعدته يساوي
es_es: la longitud de su base sea igual a %d y que su altura sea igual a %d
nl: zodanig dat de lengte van de basis gelijk is aan %d en de hoogte aan %d
sv: så att basen är %d lång och höjden är %d

source: such that lengths of its catheti are equal to %d and %d
ar: %d و %d بحيث تكون أطوال الاضلاع المجاورة للزاوية القائمة مساوية لـ
es_es: las longitudes de sus catetos sean iguales a %d y %d
nl: zodanig dat de lengte van de katheti gelijk is aan %d en %d
sv: så att kateterna är %d och %d långa

source: such that lengths of both of its catheti are equal to %d
ar: %d بحيث تكون أطوال الاضلاع المجاورة للزاوية القائمة مساوية لـ
es_es: la longitud de sus dos catetos sea igual a %d
nl: zodanig dat de lengte van beide katheti gelijk is aan %d
sv: så att båda kateterna är %d långa

source: such that length of its hypotenuse is equal to %d
ar: %d بحيث يساوي طول الوتر
es_es: la longitud de su hipotenusa sea igual a %d
nl: zodanig dat de lengte van de hypotensie gelijk is aan %d
sv: så att hypotenusan är %d lång

source: such that length of one of its sides is equal to %d and height to %d
ar: %d والارتفاع إلى %d بحيث أن طول أحد أضلاعه يساوي
es_es: la longitud de uno de sus lados sea igual a %d y que su altura sea igual a %d
nl: zodanig dat de lengte van een van de zijden gelijk is aan %d en de hoogte aan %d
sv: så att en sida är %d lång och höjden är %d

source: such that length of its radius is equal to %d
ar: %d بحيث يساوي طول نصف قطرها
es_es: la longitud de su radio sea igual a %d
nl: zodanig dat de lengte van de straal gelijk is aan %d
sv: så att radien är %d

source: Test yourself
ar: اختبر نفسك
es_es: Ponte a prueba
nl: Test jezelf
sv: Testa dig själv

source: Clock
ar: الساعه
es_es: Reloj
nl: Klok
sv: Klocka

source: Learn to read the time
ar: تعلم قراءة الوقت
es_es: Aprende a leer el reloj
nl: Leer de tijd te lezen
sv: Lär dig att läsa tiden

source: Learn to set the clock
ar: تعلم ضبط الساعة
es_es: Aprende a ajustar el reloj
nl: Leer de klok in te stellen
sv: Lär dig att ställa klockan

source: Set the clock to:
ar: اضبط الساعة على:
es_es: Ajustar el reloj a:
nl: Zet de klok op:
sv: Ställ klockan på:

source: Drag the clock hands to set the time
ar: اسحب عقارب الساعة لضبط الوقت
es_es: Arrastra las manecillas para ajustar el reloj
nl: Sleep de wijzers van de klok om de tijd in te stellen
sv: Dra visarna för att ställa tiden

source: What time is it?
ar: كم الساعه الان ؟
es_es: ¿Qué hora es?
nl: Hoe laat is het?
sv: Vad är klockan?

source: Time
ar: الوقت
es_es: Tiempo
nl: Tijd
sv: Tid

source: Turn the clock hands and see what happens.
ar: اقلب عقارب الساعة وانظر ماذا يحدث.
es_es: Gira las manecillas del reloj y observa qué ocurre.
nl: Draai de wijzers van de klok en zie wat er gebeurt.
sv: Vrid visarna och se vad som händer.

source: Time in text version only
ar: الوقت كنص فقط
es_es: Tiempo solo en versión de texto
nl: Tijd in tekstversie alleen
sv: Tid i endast textversion

source: How clock works?
ar: كيف تعمل الساعه ؟
es_es: ¿Cómo funciona un reloj?
nl: Hoe werkt de klok?
sv: Hur fungerar klockan?

source: Columnar addition
ar: الجمع بنظام الاعمدة
es_es: Suma de la columna
nl: Kolomvormige toevoeging
sv: Addition i kolumner

source: Columnar subtraction
ar: الطرح بنظام الاعمدة
es_es: Resta de la columna
nl: Kolomvormige aftrekking
sv: Subtraktion i kolumner

source: Long multiplication
ar: الضرب المطول
es_es: Multiplicación larga
nl: Lange vermenigvuldiging
sv: Lång multiplikation

source: Long division
ar: القسمة المطلولة
es_es: División larga
nl: Lange divisie
sv: Lång division

source: Demonstration
ar: إثبات
es_es: Demostración
nl: Demonstratie

source: Do it yourself
ar: نفذها بنفسك
es_es: Hazlo tú
nl: Doe het zelf
sv: Gör det själv

source: borrow 10
ar: استلف 10
es_es: tomo 10
nl: Leen 10
sv: låna 10

source: carry
ar: حمل
es_es: me llevo
nl: dragen
sv: överför

source: Start >>
ar: ابدأ
es_es: Comenzar >>
sv: Starta >>

source: Next example >>
ar: المثال التالى
es_es: Siguiente ejemplo >>
nl: Volgende voorbeeld >>
sv: Nästa exempel >>

source: Next step >>
ar: الخطوة التالية
es_es: Siguiente paso >>
nl: Volgende stap >>
sv: Nästa steg >>

source: write
ar: اكتب
es_es: escribe
nl: schrijf
sv: skriv

source: rewrite
ar: اعد كتابة
es_es: reescribir
nl: herschrijven
sv: skriv om

source: remainder
ar: الباقى
es_es: resto
nl: restant
sv: rest

source: result
ar: النتيجة
es_es: resultado
nl: resultaat
sv: resultat

source: Find solution
ar: اوجد الحل
es_es: Encontrar solución
nl: Oplossing vinden
sv: Hitta lösning

source: Find missing number
ar: اوجد الرقم المفقود
es_es: Enconttrar número perdido
nl: Zoek ontbrekend nummer
sv: Hitta det saknade talet

source: numerator
ar: البسط
es_es: numerador
nl: teller
sv: täljare

source: denominator
ar: المقام
es_es: denominador
nl: noemer
sv: nämnare

source: Experiment with fractions
ar: تمارين على الكسور
es_es: Experimentar con fracciones
nl: Experimenteren met breuken
sv: Experimentera med bråk

source: Experiment with decimal fractions
ar: تمارين على الكسور العشرية
es_es: Experimentar con fracciones decimales
nl: Experimenteer met decimale breuken
sv: Experimentera med decimaltal

source: Ratio
ar: النسبة والتناسب
es_es: Relac.
nl: Verhouding
sv: Förhållande

source: Experiment with ratios
ar: تمارين على النسبة
es_es: Experimentar con proporciones
nl: Experimenteren met verhoudingen
sv: Experimentera med förhållanden

source: Experiment with percentages
ar: تمارين على النسب المئوية
es_es: Experimentar con porcentajes
nl: Experimenteren met percentages
sv: Experimentera med procent

source: What fraction is it?
ar: ماهو الكسر ؟
es_es: ¿Qué fracción es?
nl: Welke bruk is het?
sv: Vilket bråk är det?

source: What decimal fraction is it?
ar: ماهو الكسر العشرى ؟
es_es: ¿Qué fracción decimal es?
nl: Welke decimale breuk is het?
sv: Vilket decimaltal är det?

source: Add fractions with the same denominator
ar: جمع الكسور التي لها نفس المقام
es_es: Sumar fracciones con el mismo denominador
nl: Breuken met dezelfde noemer optellen
sv: Lägg till bråk med samma nämnare

source: Subtract fractions with the same denominator
ar: طرح الكسور التي لها نفس المقام
es_es: Restar fracciones con el mismo denominador
nl: Breuken met dezelfde noemer aftrekken
sv: Subtrahera bråk med samma nämnare

source: Multiply fractions
ar: ضرب الكسور
es_es: Multiplicar fracciones
nl: Vermenigvuldig breuken
sv: Multiplicera bråk

source: Divide fractions
ar: قسمة الكسور
es_es: Dividir fracciones
nl: Breuken verdelen
sv: Dividera bråk

source: Exercise 1
ar: تدريب رقم 1
es_es: Ejercicio 1
nl: Oefening 1
sv: Övning 1

source: Exercise 2
ar: تدريب رقم 2
es_es: Ejercicio 2
nl: Oefening 2
sv: Övning 2

source: Exercise 3
ar: تدريب رقم 3
es_es: Ejercicio 3
nl: Oefening 3
sv: Övning 3

source: Compare decimals and fractions
ar: قارن بين الكسور العشرية والكسور
es_es: Comparar decimales y fracciones
nl: Vergelijk decimalen en breuken
sv: Jämför decimaltal och bråk

source: Compare fractions
ar: مقارنة الكسور
es_es: Comparar fracciones
nl: Breuken vergelijken
sv: Jämför bråk

source: Reduce fractions
ar: تنسيط الكسور
es_es: Reducir fracciones
nl: Breuken verminderen
sv: Förkorta bråk

source: Expand fractions
ar: كبر الكسور
es_es: Expandir fracciones
nl: Breid breuken uit
sv: Expandera bråk
