Repository: imiolek-ireneusz/eduActiv8
Catalog: i18n/po/*.po
Languages: ar, es_es, nl, sv

source: Laby, 2010 by Mehdi Cherti (mehdidc) Sounds by various authors who contributed their works to freesound.org. Images by various authors who contributed their works to openclipart.org (Public Domain) and http://www.art4apps.org/ - Art4Apps by Smart4Kids - under a Creative Commons License (CC BY-SA). Please view credits.txt for more info about authors of media files used in this project
ar: لعبة لابي، 2010 من تطوير مهدي شرطي (mehdidc) الأصوات من مؤلفين متنوعين ساهموا بأعمالهم في موقع freesound.org. الصور من مؤلفين متنوعين ساهموا بأعمالهم في openclipart.org (الملكية العامة) و http://www.art4apps.org/ - مشروع Art4Apps من Smart4Kids - تحت رخصة المشاع الإبداعي (CC BY-SA). يرجى مراجعة ملف credits.txt لمزيد من المعلومات عن مؤلفي الملفات المستخدمة في هذا المشروع.
nl: Laby, 2010 door Mehdi Cherti (mehdidc) Geluiden/muziek van verschillende auteurs die hun werk hebben overgedragen aan freesound.org. Afbeeldingen van verschillende auteurs die hun werk hebben overgedragen aan openclipart.org (Public Domain) en http://www.art4apps.org/ - Art4Apps door Smart4Kids - onder de Creative Commons Licentie (CC BY-SA). Voor meer informatie over de auteurs van de in dit project gebruikte mediabestanden kan u credits.txt consulteren.
sv: Laby, 2010 av Mehdi Cherti (mehdidc) Ljud av olika författare som bidrog med sina verk till freesound.org. Bilder av olika författare som bidrog med sina verk till openclipart.org (Public Domain) och http://www.art4apps.org/ - Art4Apps av Smart4Kids - under en Creative Commons-licens (CC BY-SA). Vänligen se credits.txt för mer information om författarna till mediafiler som används i detta projekt

source: This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. You should have received a copy of the GNU General Public License along with this program. If not, see <http://www.gnu.org/licenses/>.
ar: هذا البرنامج هو برنامج مجاني: يمكنك إعادة توزيعه و / أو تعديله بموجب شروط رخصة جنو العمومية كما نشرتها مؤسسة البرمجيات الحرة ، إما الإصدار 3 من الترخيص ، أو (حسب اختيارك) أي إصدار لاحق. يجب أن تكون قد تلقيت نسخة من رخصة جنو العمومية جنباً إلى جنب مع هذا البرنامج. إذا لم يكن كذلك ، راجع <http://www.gnu.org/licenses/>.
nl: Dit programma is vrije software: u kunt het herdistribueren en/of wijzigen onder de voorwaarden van de GNU General Public License zoals gepubliceerd door de Free Software Foundation, ofwel versie 3 van de Licentie, ofwel (naar uw keuze) elke latere versie. U zou een meegeleverde kopie van de GNU General Public License moeten ontvangen hebben samen met dit programma. Indien niet, zie <http://www.gnu.org/licenses/>.
sv: Detta program är fri programvara: du kan redistribuera det och/eller modifiera det enligt villkoren i GNU General Public License som publicerats av Free Software Foundation, antingen version 3 av licensen, eller (efter eget val) någon senare version. Du borde ha fått en kopia av GNU General Public License tillsammans med detta program. Om inte, se <http://www.gnu.org/licenses/>.

source: A collection of educational activities for kids
ar: مجموعة من الانشطة التعليمية للاطفال
es_es: Un conjunto de aplicaciones educativas para niños
nl: Een verzameling van educatieve activiteiten voor kinderen
sv: En samling av lärande aktiviteter för barn

source: Educational Activities for Kids
ar: انشطة تعليمية للاطفال
es_es: Paquete de actividades educativas para niños
nl: Educatieve activiteiten voor kinderen
sv: Lärande Aktiviteter för Barn

source: Images from: http://www.art4apps.org/ - Art4Apps by Smart4Kids - Creative Commons License (CC BY-SA)
ar: الصور من: http://www.art4apps.org/ - مشروع Art4Apps من Smart4Kids - بموجب رخصة المشاع الإبداعي (CC BY-SA)
es_es: Imágenes de: http://www.art4apps.org/ - Art4Apps by Smart4Kids - Creative Licencia Creative Commons (CC BY-SA)
nl: Afbeeldingen van: http://www.art4apps.org/ - Art4Apps door Smart4Kids - Creative Commons Licentie (CC BY-SA)
sv: Bilder från: http://www.art4apps.org/ - Art4Apps av Smart4Kids - Creative Commons License (CC BY-SA)

source: Default Language:
ar: اللغة الافتراضية
es_es: Idioma por defecto:
nl: Standaardtaal:
sv: Standard Språk:

source: Guest
ar: ضيف
es_es: Invitado
nl: Gast
sv: Gäst

source: Log in:
ar: دخول
es_es: Entrar:
nl: Aanmelden:
sv: Logga in:

source: user name:
ar: اسم المستخدم
es_es: usuario:
nl: gebruikersnaam:
sv: användarnamn:

source: password:
ar: كلمة السر
es_es: contraseña:
nl: wachtwoord:
sv: lösenord:

source: Login
ar: دخول
es_es: Entrar
nl: Aanmelden

source: Add new user:
ar: اضف مستخدم جديد
es_es: Añadir nuevo usuario:
nl: Nieuwe gebruiker toevoegen:
sv: Lägg till ny användare:

source: confirm password:
ar: تأكيد كلمة السر
es_es: confirmar contraseña:
nl: bevestig het wachtwoord:
sv: bekräfta lösenord:

source: Register new user
ar: تسجيل مستخدم جديد
es_es: Register nuevo usuario
nl: Registreer nieuwe gebruiker
sv: Registrera ny användare

source: Administrator Login:
ar: دخول المدير
es_es: Usuario Administrador:
nl: Beheerder aanmelden:
sv: Administratör Login:

source: User Management
ar: ادارة المستخدمين
es_es: Usuario gestor
nl: Gebruikersbeheer
sv: Användarhantering

source: Please select a user from the list.
ar: فضلا اختر مستخدم من القائمة
es_es: Por favor, selecciona un usuario de la lista
nl: Selecteer een gebruiker uit de lijst.
sv: Välj en användare ifrån listan.

source: Delete user
ar: حذف مستخدم
es_es: Borrar usuario
nl: Gebruiker verwijderen
sv: Ta bort användare

source: Delete
ar: حذف
es_es: Borrar
nl: Verwijder
sv: Ta bort

source: Cancel
ar: الغاء
es_es: Cancelar
nl: Annuleer
sv: Avbryt

source: %s deleted from database.
ar: تم حذف %s من قاعدة البيانات.
es_es: %s borrado de la base de datos.
nl: %s verwijderd uit de databank.
sv: %sborttagen från databasen.

source: Failed to delete the user.
ar: لا يمكن حذف المستخدم
es_es: Error al borrrar usuario.
nl: De gebruiker is niet gewist.
sv: Misslyckades ta bort användaren.

source: Preferences
ar: التفضيلات
es_es: Preferencias
nl: Voorkeuren
sv: Inställningar

source: switch to full screen after login
ar: اعرض الشاشة بالكامل بعد تسجيل الدخول
es_es: cambiar a pantalla completa después de entrar
nl: overschakelen naar volledig scherm na het aanmelden
sv: växla till fullskärm efter inloggning

source: allow users to navigate to locked levels
ar: السماح للمستخدمين بالتنقل إلى المستويات المقفلة
es_es: permitir a los usuarios navegar a los niveles bloqueados
nl: gebruikers toestaan naar vergrendelde niveaus te navigeren
sv: tillåt användare att navigera till låsta nivåer

source: allow adding new users on login screen
ar: اضافة مستخدمين جدد خلال شاشة تسجيل الدخول
es_es: permitir añadir usuarios en la pantalla de login
nl: het toevoegen van nieuwe gebruikers op het aanmeldscherm mogelijk maken
sv: tillåt lägga till ny användare på inloggningsskärmen

source: User Name
ar: اسم المستخدم
es_es: Tu nombre
nl: Gebruikersnaam
sv: Användarnamn

source: require password to log in
ar: تحتاج كلمة سر للدخول
es_es: pedir contraseña para entrar
nl: wachtwoord nodig om aan te melden
sv: kräv lösenord vid inloggning

source: require password to access admin area
ar: كلمة سر لوحة تحكم المدير
es_es: pedir contraseña para acceder al panel de administrador
nl: wachtwoord nodig om toegang te krijgen tot het beheerder-gedeelte
sv: kräv lösenord för åtkomst till administrationsområdet

source: Update admin's password:
ar: تحديث كلمة سر المدير
es_es: Actualizar la contraseña de administrador:
nl: Update beheerder's wachtwoord:
sv: Uppdatera administratörens lösenord:

source: previous password:
ar: كلمة السر السابقة
es_es: contraseña anterior:
nl: vorig wachtwoord:
sv: tidigare lösenord:

source: new password:
ar: كلمة السر الجديدة
es_es: nueva contraseña:
nl: nieuw wachtwoord:
sv: nytt lösenord:

source: confirm new password:
ar: تأكيد كلمة السر الجديدة
es_es: confirmar nueva contraseña:
nl: bevestig het nieuwe wachtwoord:
sv: bekräfta nytt lösenord:

source: Create admin's account:
ar: انشاء حساب المدير
es_es: Crear cuenta administrador:
nl: Maak beheerder's account aan:
sv: Skapa administratörskonto:

source: admin's user name:
ar: اسم مستخدم حساب المدير
es_es: usuario administrador:
nl: gebruikersnaam van de beheerder:
sv: administratörens användarnamn:

source: admin's password:
ar: كلمة سر حساب المدير
es_es: contraseña administrador:
nl: beheerders wachtwoord:
sv: administratörens lösenord:

source: confirm admin's password:
ar: تاكيد كلمة سر حساب المدير
es_es: confirmar contraseña administrador:
nl: bevestig beheerders wachtwoord:
sv: bekräfta administratörens lösenord:

source: Save
ar: حفظ
es_es: Guardar
nl: Bewaar
sv: Spara

source: Please enter user name (at least 3 characters long)
ar: ادخل اسم المستخدم ( 3 حروف على الاقل )
es_es: Por favor introduce el nombre de usuario (al menos 3 caracteres)
nl: Voer de gebruikersnaam in (minstens 3 karakters lang)
sv: Fyll i användarnamn (minst 3 tecken långt)

source: Please enter password (at least 4 characters long)
ar: ادخل كلمة السر ( 4حروف على الاقل )
es_es: Por favor introduce la contraseña (al menos 4 caracteres)
nl: Voer het wachtwoord in (minstens 4 karakters lang)
sv: Fyll i lösenord (minst 4 tecken långt)

source: This username and password combination doesn't exist.
ar: توليفة اسم المستخدم وكملة السر غير موجودة
es_es: La combinación de usuario y contraseña no existe.
nl: Deze gebruikersnaam en wachtwoord combinatie bestaat niet.
sv: Denna kombination av användarnamn och lösenord existerar inte.

source: This username doesn't exist.
ar: اسم المستخدم غير موجود
es_es: El usuario no existe.
nl: Deze gebruikersnaam bestaat niet.
sv: Detta användarnamn existerar inte.

source: Passwords don't match
ar: كلمات السر غير متطابقة
es_es: Las contraseñas no coinciden
nl: Wachtwoorden komen niet overeen
sv: Lösenorden stämmer ej överens

source: %s added
ar: تمت إضافة %s
es_es: %s añadido
nl: %s toegevoegd
sv: %s tillagd

source: This user name already exists, please choose a different one
ar: هذا المستخدم موجود مسبقا اختر مستخدم اخر
es_es: Este usuario ya existe, prueba con un nombre diferente
nl: Deze gebruikersnaam bestaat al, kies een andere.
sv: Detta användarnamn existerar redan, välj ett annat

source: Admin's password has been updated
ar: تم تحديث كلمة سر المدير
es_es: La contraseña de administrador se ha actualizado
nl: Beheerders wachtwoord is bijgewerkt
sv: Administratörens lösenord har blivit uppdaterat

source: ERROR: This operation is not allowed at this point
ar: خطأ : هذا العملية غير مسموح بها فى تلك المرحلة
es_es: ERROR: Esta operación no está permitida aquí
nl: FOUT: Deze handeling is op dit moment niet toegestaan.
sv: FEL: Denna handling är en möjligt just nu

source: Please enter previous password (at least 4 characters long)
ar: فضلا ادخل كلمة السر السابقة ( 4 حروف على الاقل )
es_es: Por favor introduce la contraseñña anterior (al menos 4 caracteres)
nl: Voer het vorige wachtwoord in (minstens 4 karakters lang)
sv: Fyll i föregående lösenord (minst 4 tecken långt)

source: Please enter new password (at least 4 characters long)
ar: فضلا ادخل كلمة السر الجديدة ( 4 حروف على الاقل )
es_es: Por favor introduce la nueva contraseña (al menos 4 caracteres)
nl: Voer een nieuw wachtwoord in (minstens 4 karakters lang)
sv: Fyll i nytt lösenord (minst 4 tecken långt)

source: Previous password doesn't seem to be in the database
ar: كلمة السر السابقة غير موجودة بقاعدة البيانات
es_es: La contraseña anterior no está en la base de datos
nl: Vorig wachtwoord lijkt niet in de databank te staan
sv: Föregående lösenord hittats ej i databasen

source: Registered:
ar: مسجل :
es_es: Registrado:
nl: Geregistreerd:
sv: Registrerad:

source: Last login:
ar: الدخول الاخير :
es_es: Última entrada:
nl: Laatste aanmelding:
sv: Senaste inloggning:

source: Preferences saved...
ar: تم حفظ التفضيلات :
es_es: Preferencias guardadas...
nl: Voorkeuren opgeslagen...
sv: Inställningar sparade...

source: Logged in as:
ar: تم تسجيل الدخول كـ :
es_es: Accedido como:
nl: Aangemeld als:
sv: Inloggad som:

source: (Log out)
ar: (تسجيل الخروج)
es_es: (Salir)
nl: (Afmelden)
sv: (Logga ut)

source: remember me
ar: تذكرنى
es_es: recuérdame
nl: onthou mij
sv: kom ihåg mig

source: Select age group:
ar: اختر المجموعة العمرية :
es_es: Seleccionar grupo de edad:
nl: Selecteer leeftijdsgroep:
sv: Välj åldersgrupp:

source: show activities for:
ar: اعرض الانشطة لـ :
es_es: mostrar actividades para:
nl: toon activiteit voor:
sv: visa aktiviteter för:

source: preschool
ar: ماقبل المدرسة :
es_es: Preescolar
nl: kleuterklas
sv: förskola

source: Year 1
ar: 1 عام
es_es: Año 1
nl: 1e Leerjaar
sv: Årskurs 1

source: Year 2
ar: 2 عام
es_es: Año 2
nl: 2de Leerjaar
sv: Årskurs 2

source: Year 3
ar: 3 اعوام
es_es: Año 3
nl: 3de Leerjaar
sv: Årskurs 3

source: Year 4
ar: 4 اعوام
es_es: Año 4
nl: 4de Leerjaar
sv: Årskurs 4

source: Year 5
ar: 5 اعوام
es_es: Año 5
nl: 5de Leerjaar
sv: Årskurs 5

source: Year 6
ar: 6 اعوام
es_es: Año 6
nl: 6de Leerjaar
sv: Årskurs 6

source: show all
ar: عرض الكل
es_es: mostrar todo
nl: toon alles
sv: visa alla

source: Do you want to log out of the game?
ar: هل ترغب بتسجيل الخروج من اللعبة ؟
es_es: ¿Quieres cerrar sessión del juego?
nl: Wil je je afmelden uit het spel?
sv: Vill du logga ut ifrån spelet?

source: Do you want to exit the game?
ar: هل ترغب بالخروج من اللعبة ؟
es_es: ¿Quieres salir del juego?
nl: Wilt u het spel verlaten?
sv: Vill du avsluta spelet?

source: Ready to go to the next level?
ar: واو ..هل ترغب بالانتقال الى المستوى الاعلى ؟
es_es: ¿Preparado para ir al siguiente nivel?
nl: Klaar om naar het volgende niveau te gaan?
sv: Redo att gå till nästa nivå?

source: Hello
ar: اهلا
es_es: Hola
nl: Hallo
sv: Hejsan

source: Welcome back in the game.
ar: اهلا بك فى اللعبة
es_es: Te damos nuevamente la bienvenida a eduactiveyt.
nl: Welkom terug in het spel.
sv: Välkommen tillbaka till spelet.

source: Licence
ar: ترخيص
nl: Licentie
sv: Licens

source: Copyright & Credits
ar: حقوق الطبع والنشر والفضل
es_es: Autoría y Créditos
nl: Auteursrecht & Credits
sv: Upphovsrätt och krediter

source: Translators
ar: مترجمين
es_es: Traducción
nl: Vertalers
sv: Översättare

source: Language
ar: لغة
es_es: Idioma
nl: Taal
sv: Språk

source: Translations
ar: ترجمات
es_es: Traducciones
nl: Vertalingen
sv: Översättningar

source: Addition Table
ar: جدول الجمع
es_es: Tabla de adiciones
nl: Optellingen tabel
sv: Additionstabell

source: Discover Letters
ar: اكتشف الحروف
es_es: Descubre las letras
nl: Ontdek de letters
sv: Upptäck bokstäver

source: Learn New Words
ar: تعلم كلمات جديدة
es_es: Aprende nuevas palabras
nl: Nieuwe woorden leren
sv: Lär dig nya ord

source: Mathematics
ar: الرياضيات
es_es: Matemáticas
nl: Wiskunde
sv: Matematik

source: Art and Colour
ar: الرسم والالوان
es_es: Arte y Color
nl: Kunst en kleuren
sv: Konst och färg

source: Memory
ar: الذاكرة
es_es: Memoria
nl: Geheugen
sv: Minne

source: Games & Mazes
ar: الالعاب والمتاهات
es_es: Juegos y Laberintos
nl: Spelletjes & doolhoven
sv: Spel och labyrinter

source: Letters
ar: الحروف
es_es: Letras
sv: Bokstäver

source: Learn Letters with Flashcards
ar: تعلم الحروف باستخدام البطاقات
es_es: Aprende las letras con tarjetas didácticas
nl: Letters leren met flitskaarten
sv: Lär dig bokstäver med bildkort

source: Learn to Write
ar: تعلم الكتابة
es_es: Aprende a escribir
nl: Leren schrijven
sv: Lär dig att skriva

source: Trace Letters and Numbers
ar: تتبع الحروف والارقام
es_es: Dibuja las letras y los números
nl: Trek letters en cijfers over
sv: Spåra bokstäver och siffror

source: Complete the ABC
ar: اكمل الحروف
es_es: Completa el abecedario
nl: Maak het ABC af
sv: Fyll i ABC

source: Sorting Letters
ar: ترتيب الحروف
es_es: Ordenar letras
nl: Letters sorteren
sv: Sortera bokstäver

source: Lowercase Letters
ar: حروف صغيرة
es_es: Letras minúsculas
nl: Kleine letters
sv: Gemener

source: Uppercase Letters
ar: حروف كبيرة
es_es: Letras mayúsculas
nl: Hoofdletters
sv: Versaler

source: Word Builder
ar: منشئ الكلمات
es_es: Construye las palabras
nl: Woordbouwer
sv: Ordbyggare

source: Word Maze
ar: متاهة الكلمة
es_es: Laberinto de palabras
nl: Woord doolhof
sv: Ordlabyrint

source: Collect all letters in the right order
ar: اجمع الحروف بالترتيب الصحيح
es_es: Recoge todas las letras en el orden correcto
nl: Verzamel alle letters in de juiste volgorde
sv: Samla alla bokstäver i rätt ordning

source: Word Maze + 4
ar: متاهة الكلمة + 4
es_es: Laberinto de palabras + 4
nl: Woord doolhof + 4
sv: Ordlabyrint + 4

source: Rainbow Keyboard
ar: لوحة مفاتيح قوس قزح
es_es: Habilidad con el teclado
nl: Regenboog toetsenbord
sv: Regnbågstangentbord

source: Touch Typing Tutor
ar: مدرب الكتابة باللمس
es_es: Mecanografía
nl: Tikkend typen leraar
sv: Touch-typningsövning

source: English Alphabet
ar: حروف الابجدية الانجليزية
es_es: Alfabeto inglés
nl: Nederlands alfabet
sv: Engelska alfabetet

source: Your Alphabet
ar: حروفك الابجدية
es_es: Alfabeto español
nl: Uw alfabet
sv: Svenska alfabetet

source: Numbers
ar: الارقام
es_es: Números
nl: Nummers
sv: Siffror

source: Number Spelling
ar: تهجى الارقام
es_es: Escritura de números
nl: Nummer spelling
sv: Sifferstavning

source: Match numbers to their spelling
ar: وصل الارقام بهجائها
es_es: Relaciona los números con su forma escrita
nl: Koppelen van nummers met hun spelling
sv: Matcha siffror med deras stavning

source: Learn Numbers with Flashcards
ar: تعلم الارقام بالبطاقات
es_es: Aprende los números con tarjetas didácticas
nl: Leer nummers met Flash cards
sv: Lär dig siffror med bildkort

source: Learn to Count
ar: تعلم العد
es_es: Aprende a contar
nl: Leren tellen
sv: Lär dig räkna

source: Basic Addition
ar: الجمع البسيط
es_es: Suma básica
nl: Basis sommen
sv: Grundläggande addition

source: Basic Subtraction
ar: الطرح البسيط
es_es: Resta básica
nl: Basis aftrekken
sv: Grundläggande subtraktion

source: Shopping List
ar: قائمة المشتروات
es_es: Lista de la compra
nl: Boodschappenlijstje
sv: Inköpslista

source: Plus or Minus
ar: جمع او طرح
es_es: Más o menos
nl: Plus of min.
sv: Plus eller minus

source: Basic Operations
ar: العمليات الاساسية
es_es: Operaciones básicas
nl: Basisverrichtingen
sv: Grundläggande räknesätt

source: Multiplication Table
ar: جدول الضرب
es_es: Tabla de multiplicar
nl: Vermenigvuldigingstabel
sv: Multiplikationstabell

source: Find the product
ar: اوجد حاصل الضرب
es_es: Encuentra el producto
nl: Vind het product
sv: Hitta produkten

source: Find the multiplier
ar: اوجد المضاعف
es_es: Encuentra el multiplicador
nl: Zoek de vermenigvuldigingsfactor
sv: Hitta multiplikatorn

source: Division
ar: القسمة
es_es: División
nl: Delen

source: Sorting Numbers
ar: ترتيب الارقام
es_es: Ordena los números
nl: Sorteer nummers
sv: Sortera siffror

source: Consecutive numbers
ar: الارقام المتتالية
es_es: Números consecutivos
nl: Opeenvolgende getallen
sv: På varandra följande siffror

source: Random numbers
ar: ارقام عشوائية
es_es: Números aleatorios
nl: Willekeurige getallen
sv: Slumpmässiga siffror

source: Number Comparison
ar: المقارنة بين الاعدلد
es_es: Compara los números
nl: Nummers vergelijken
sv: Jämförelse av siffror

source: Addition & Subtraction
ar: الجمع والطرح
es_es: Suma y Resta
nl: Optellen & aftrekken
sv: Addition och subtraktion

source: Comparison
ar: المقارنة
es_es: Comparación
nl: Vergelijking
sv: Jämförelse

source: Even or Odd
ar: زوجى ام فردى
es_es: Par or Impar
nl: Even of oneven
sv: Udda eller jämn

source: Even
ar: زوجى
es_es: Par
sv: Jämn

source: Odd
ar: فردى
es_es: Impar
nl: Oneven
sv: Udda

source: Shapes and Solids
ar: أشكال ومجسمات
es_es: Curvas y sólidos
nl: Vormen en solids
sv: Former och kroppar

source: Shapes
ar: أشكال
es_es: Formas
nl: Vormen
sv: Former

source: Learn Shapes with Flashcards
ar: تعلم الاشكال بالبطاقات
es_es: Aprende las formas con tarjetas didácticas
nl: Leer Vormen met Flashcards
sv: Lär dig former med bildkort

source: Solids
ar: المجسمات
es_es: Sólidos
sv: Geometriska kroppar

source: Solid Geometry with Flashcards
ar: هندسة المجسمات باستخدام البطاقات التعليمية
es_es: Aprende geometría de los sólidos con tarjetas didácticas
nl: Vaste Geometry met Flashcards
sv: Kroppsgeometri med bildkort

source: Time Matching
ar: مطابقة الوقت
es_es: Empareja los relojes
nl: Tijdcorrectie
sv: Tidsmatchning

source: Complete the word
ar: اكمل الكلمة
es_es: Completar la palabra
nl: Maak het woord af
sv: Fyll i ordet

source: Shape Matching
ar: متاهة الخراف
es_es: Empareja las formas
nl: Vorm koppeling
sv: Formmatchning

source: Help me find my shadow
ar: ساعدنى لايجاد الظل المناسب
es_es: ayúdame a encontrar mi sombra
nl: Help me mijn schaduw te vinden
sv: Hjälp mig hitta min skugga

source: Paint
ar: لون
es_es: Pinta
nl: Kleur
sv: Måla

source: Colour Matching
ar: مطابقة الالوان
es_es: Empareja los colores
nl: Kleurencombinaties
sv: Färgmatchning

source: Label the colours
ar: حدد اسماء الالوان
es_es: Etiqueta los colores
nl: Label de kleuren
sv: Namnge färgerna

source: Follow the Arrows
ar: تتبع الاسهم
es_es: Sigue las flechas
nl: Volg de pijlen
sv: Följ pilarna

source: Remember directions
ar: تذكر الاتجاهات
es_es: recuerda las direcciones
nl: Onthoud de routebeschrijving
sv: Kom ihåg riktningar

source: Photographic Memory
ar: ذاكرة فواتوغرافية
es_es: Memoria fotográfica
nl: Fotografisch geheugen
sv: Fotografiskt minne

source: Training
ar: تدريب
es_es: Entrenamiento
nl: Opleiding
sv: Träning

source: Mouse Maze
ar: متاهة الفأرة
es_es: Laberinto del ratón
nl: Muizendoolhof
sv: Muslabyrint

source: Let's have some cheese
ar: لنأخذ بعض من الجبن
es_es: Tomemos algo de queso
nl: Laten we wat kaas nemen
sv: Låt oss äta lite ost

source: Sheep Maze
ar: متاهة الخراف
es_es: Laberinto de la oveja
nl: Schapendoolhof
sv: Fårlabyrint

source: Find the rest of the herd
ar: ابحث عن باقى القطيع
es_es: Encuentra al resto del rebaño
nl: Vind de rest van de kudde
sv: Hitta resten av flocken

source: Connect
ar: وصل
es_es: Conecta
nl: Verbind
sv: Koppla

source: Balloons with threads
ar: البالونات والخيوط
es_es: Globos con hilos
nl: Ballonnen met koordjes
sv: Ballonger med trådar

source: Fifteen
ar: خمسة عشر
es_es: Quince
nl: Vijftien
sv: Femton

source: With a Twist
ar: مع التواء
es_es: Con un giro
nl: Met een twist
sv: Med en twist

source: Mixing Colours for Painting
ar: اخلط الالوان للتلوين
es_es: Mezcla de colores para pintar
nl: Mengen van kleuren om te schilderen
sv: Blanda färger för målning

source: Mix red, yellow, blue, black and white paint
ar: امزج الاحمر والاصفر والاسود والابيض
es_es: Mezcla pintura roja, amarilla, azul, negra y blanca
nl: Meng rode, gele, blauwe, zwarte en witte verf
sv: Blanda röd, gul, blå, svart och vit färg

source: Additive Colour Mixing - Light
ar: خلط الألوان المضافة - الضوء
es_es: Mezcla aditiva de colores: Luz
nl: Additieve kleurmenging - Licht
sv: Additiv färgblandning – ljus

source: Mix red, green and blue light to get other colours
ar: امزج الضوء الأحمر والأخضر والأزرق للحصول على ألوان أخرى
es_es: Mezcla luz roja, verde y azul para obtener otros colores
nl: Meng rood, groen en blauw licht om andere kleuren te krijgen
sv: Blanda rött, grönt och blått ljus för att få andra färger

source: Subtractive Colour Mixing - Paints, Dyes, Inks
ar: خلط الألوان الطرحية - الدهانات والأصباغ والأحبار
es_es: Mezcla sustractiva de colores: Pinturas, Tintes
nl: Subtractieve kleurmenging - Verven, kleurstoffen, inkten
sv: Subtraktiv färgblandning – färger, färgämnen, bläck

source: Mix cyan, magenta and yellow paint to get other colours
ar: امزج السماوي والأرجواني والأصفر للحصول على ألوان أخرى
es_es: Mezcla pintura ciano, magenta y amarilla para obtener otros colores
nl: Meng cyaan, magenta en gele verf om andere kleuren te krijgen
sv: Blanda cyan, magenta och gul färg för att få andra färger
